crowdwave/ch559samplestranslated/EVT/EXAM/USB/Host/USBH_HUB_KM.C
/********************************** (C) COPYRIGHT *********** ********************
* File Name: USBH_HUB_KM.C
* Author: WCH
* Version: V1.6
* Date: 2018/07/23
* Description:
 USB host example for CH559, start USB device under DP/DM and HP/HM port
 USB host application example, initialize and enumerate the devices connected to the USB port, support up to 2 USB devices at the same time, support level 1 external HUB,
 Can operate USB keyboard, mouse and HUB, including HID command processing
 U disk operation is not supported, if you need to operate U disk, please refer to other examples
 Support simple USB printer operation without processing USB printer commands
************************************************** *****************************/
#include <CH559.H>
#include <stdio.h>
#include <string.h>
//#define DISK_BASE_BUF_LEN 512 /* The default disk data buffer size is 512 bytes (you can choose 2048 or even 4096 to support some large-sector U disks). If it is 0, it is forbidden to define the buffer in this file and Specified by the application in pDISK_BASE_BUF*/
#define FOR_ROOT_UDISK_ONLY 1 // Only used for U disk file operation of DP/DM port (using subroutine library CH559UFI/X), does not support U disk operation under HUB
//You also need to add LIB library files
//#define NO_DEFAULT_ACCESS_SECTOR 1 /* The default disk sector read and write subroutine is forbidden, and replace it with a self-written program below */
//#define NO_DEFAULT_DISK_CONNECT 1 /* The default check disk connection subroutine is forbidden, replace it with a self-written program below */
//#define NO_DEFAULT_FILE_ENUMER 1 /* The default file name enumeration callback program is prohibited, and replace it with a self-written program below */
#include "..\..\USB_LIB\CH559UFI.H"
#include "..\..\USB_LIB\CH559UFI.C"
#pragma NOAREGS
// Each subroutine returns status code
#define ERR_SUCCESS 0x00 // operation is successful
#define ERR_USB_CONNECT 0x15 /* A USB device connection event has been detected and has been connected */
#define ERR_USB_DISCON 0x16 /* A USB device disconnection event has been detected and has been disconnected */
#define ERR_USB_BUF_OVER 0x17 /* The data transmitted by USB is wrong or there is too much data and buffer overflow */
#define ERR_USB_DISK_ERR 0x1F /* USB storage operation failed, it may be that the USB storage is not supported during initialization, and the disk may be damaged or disconnected during read and write operations */
#define ERR_USB_TRANSFER 0x20 /* NAK/STALL and other error codes are in 0x20~0x2F */
#define ERR_USB_UNSUPPORT 0xFB /*USB device not supported*/
#define ERR_USB_UNKNOWN 0xFE /*Device operation error*/
/*Get device descriptor*/
UINT8C SetupGetDevDescr[] = {USB_REQ_TYP_IN, USB_GET_DESCRIPTOR, 0x00, USB_DESCR_TYP_DEVICE, 0x00, 0x00, sizeof( USB_DEV_DESCR ), 0x00 };
/*Get configuration descriptor*/
UINT8C SetupGetCfgDescr[] = {USB_REQ_TYP_IN, USB_GET_DESCRIPTOR, 0x00, USB_DESCR_TYP_CONFIG, 0x00, 0x00, 0x04, 0x00 };
/*Set the USB address*/
UINT8C SetupSetUsbAddr[] = {USB_REQ_TYP_OUT, USB_SET_ADDRESS, USB_DEVICE_ADDR, 0x00, 0x00, 0x00, 0x00, 0x00 };
/*Set USB configuration*/
UINT8C SetupSetUsbConfig[] = {USB_REQ_TYP_OUT, USB_SET_CONFIGURATION, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 };
/*Set USB IDLE*/
UINT8C SetupSetUsbIDLE[] = {0x21, HID_SET_IDLE, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 };
/*Set the USB interface configuration*/
UINT8C SetupSetUsbInterface[] = {USB_REQ_RECIP_INTERF, USB_SET_INTERFACE, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 };
/*Clear endpoint STALL*/
UINT8C SetupClrEndpStall[] = {USB_REQ_TYP_OUT | USB_REQ_RECIP_ENDP, USB_CLEAR_FEATURE, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 };
/*Get HUB descriptor*/
UINT8C SetupGetHubDescr[] = {HUB_GET_HUB_DESCRIPTOR, HUB_GET_DESCRIPTOR, 0x00, USB_DESCR_TYP_HUB, 0x00, 0x00, sizeof( USB_HUB_DESCR ), 0x00 };
/*Get HID device report descriptor*/
UINT8C SetupGetHIDDevReport[] = {0x81, USB_GET_DESCRIPTOR, 0x00, USB_DESCR_TYP_REPORT, 0x00, 0x00, 0x41, 0x00 };
/*Printer commands*/
UINT8C XPrinterReport[] = {0xA1, 0, 0x00, 0, 0x00, 0x00, 0xF1, 0x03 };
UINT8X UsbDevEndp0Size; /* The maximum packet size of endpoint 0 of the USB device */
/*USB device related information table, CH559 supports up to 2 devices*/
#define ROOT_DEV_DISCONNECT 0
#define ROOT_DEV_CONNECTED 1
#define ROOT_DEV_FAILED 2
#define ROOT_DEV_SUCCESS 3
#define DEV_TYPE_KEYBOARD (USB_DEV_CLASS_HID | 0x20)
#define DEV_TYPE_MOUSE (USB_DEV_CLASS_HID | 0x30)
UINT8 Set_Port = 0;
struct _RootHubDev
{
    UINT8 DeviceStatus; // Device status, 0-no device, 1-device but not initialized, 2-device but initialization enumeration failed, 3-device and initialization enumeration succeeded
    UINT8 DeviceAddress; // The assigned USB address of the device
    UINT8 DeviceSpeed; // 0 is low speed, non-zero is full speed
    UINT8 DeviceType; // Device type
// union {
// struct MOUSE {
// UINT8 MouseInterruptEndp; // Mouse Interrupt Endpoint Number
// UINT8 MouseIntEndpTog; // The synchronization flag of the mouse interrupt endpoint
// UINT8 MouseIntEndpSize; // The length of the mouse interrupt endpoint
//}
// struct PRINT {
//}
//}
//..... struct _Endp_Attr Endp_Attr[4]; //The attributes of the endpoint, supports up to 4 endpoints
    UINT8 GpVar; // General variable
    UINT8 GpVar1; // General variable 1
} xdata RootHubDev[2];
#define HUB_MAX_PORTS 4
/*
Convention: USB device address allocation rules (refer to USB_DEVICE_ADDR)
Address value Device location
0x02 USB device or external HUB under built-in Root-HUB0
0x03 USB device or external HUB under built-in Root-HUB1
0x1x USB device under port x of the external HUB under built-in Root-HUB0, x is 1~n
0x2x USB device under port x of the external HUB under built-in Root-HUB1, x is 1~n
*/
struct _DevOnHubPort
{
    UINT8 DeviceStatus; // Device status, 0-no device, 1-device but not initialized, 2-device but initialization enumeration failed, 3-device and initialization enumeration succeeded
    UINT8 DeviceAddress; // The assigned USB address of the device
    UINT8 DeviceSpeed; // 0 is low speed, non-zero is full speed
    UINT8 DeviceType; // Device type
//..... struct _Endp_Attr Endp_Attr[4]; //The attributes of the endpoint, supports up to 4 endpoints
    UINT8 GpVar; // General variable
} xdata DevOnHubPort[2][HUB_MAX_PORTS]; // Assumption: no more than 2 external HUBs, and no more than HUB_MAX_PORTS ports for each external HUB (no matter if there are more)
