crowdwave/ch559samplestranslated/EVT/EXAM/USB/Host/USBH_HUB_KM.C
UINT8X RxBuffer[ MAX_PACKET_SIZE] _at_ 0x0000; // IN, must even address
UINT8X TxBuffer[ MAX_PACKET_SIZE] _at_ 0x0040; // OUT, must even address
#define pSetupReq ((PXUSB_SETUP_REQ)TxBuffer)
bit RootHubId; // The currently operating root-hub port number: 0=HUB0,1=HUB1
bit FoundNewDev;
#pragma NOAREGS
#define WAIT_USB_TOUT_200US 200 // Waiting for USB interrupt timeout time 200uS@Fsys=12MHz
void mDelayuS( UINT16 n ); // Delay in uS
void mDelaymS( UINT16 n ); // Delay in mS
void DisableRootHubPort( UINT8 RootHubIndex ); // Close the specified ROOT-HUB port, in fact, the hardware has been automatically closed, here is just to clear some structure states
UINT8 AnalyzeRootHub( void ); // Analyze the ROOT-HUB status and handle the ROOT-HUB port device plug-in event
// Return ERR_SUCCESS for no condition, return ERR_USB_CONNECT for new connection detected, return ERR_USB_DISCON for detected disconnection
void SetHostUsbAddr( UINT8 addr ); // Set the USB device address currently operated by the USB host
void SetUsbSpeed( UINT8 FullSpeed ​​); // Set the current USB speed
void ResetRootHubPort( UINT8 RootHubIndex ); // After the device is detected, reset the bus of the corresponding port to prepare for enumerating the device, and set it to default to full speed
UINT8 EnableRootHubPort( UINT8 RootHubIndex ); // Enable the ROOT-HUB port, and the corresponding bUH_PORT_EN is set to 1 to enable the port, and the device disconnection may cause the return failure
void SelectHubPort( UINT8 RootHubIndex, UINT8 HubPortIndex );// HubPortIndex=0 selects the designated ROOT-HUB port for operation, otherwise, selects the designated port of the external HUB that operates the designated ROOT-HUB port
UINT8 WaitUSB_Interrupt( void ); // Wait for USB interrupt
// CH559 transfer transaction, enter the destination endpoint address/PID token, synchronization flag, the total NAK retry time in units of 20uS (0 means no retry, 0xFFFF unlimited retry), return 0 success, timeout/error retry
UINT8 USBHostTransact( UINT8 endp_pid, UINT8 tog, UINT16 timeout ); // endp_pid: the upper 4 bits are the token_pid token, the lower 4 bits are the endpoint address
UINT8 HostCtrlTransfer( PUINT8 DataBuf, PUINT8 RetLen ); // Perform control transfer, 8-byte request code is in pSetupReq, and DataBuf is an optional transmit and receive buffer
// If you need to receive and send data, then DataBuf needs to point to a valid buffer for storing subsequent data, and the total length of the actual successfully sent and received is returned and saved in the byte variable pointed to by ReqLen
void CopySetupReqPkg( PUINT8C pReqPkt ); // Copy control transmission request packet
UINT8 CtrlGetDeviceDescr( void ); // Get the device descriptor and return it in TxBuffer
UINT8 CtrlGetConfigDescr( void ); // Get the configuration descriptor and return it in TxBuffer
UINT8 CtrlSetUsbAddress( UINT8 addr ); // Set USB device address
UINT8 CtrlSetUsbConfig( UINT8 cfg ); // Set USB device configuration
UINT8 CtrlSetUsbIntercace( UINT8 cfg ); // Set USB device interface
UINT8 CtrlClearEndpStall( UINT8 endp ); // Clear endpoint STALL
UINT8 CtrlGetHubDescr( void ); // Get the HUB descriptor and return it in TxBuffer
UINT8 HubGetPortStatus( UINT8 HubPortIndex ); // Query the status of the HUB port and return it in TxBuffer
UINT8 HubSetPortFeature( UINT8 HubPortIndex, UINT8 FeatureSelt ); // Set HUB port characteristics
UINT8 HubClearPortFeature( UINT8 HubPortIndex, UINT8 FeatureSelt ); // Clear HUB port feature
UINT8 AnalyzeHidIntEndp( PUINT8X buf ); // Analyze the address of the HID interrupt endpoint from the descriptor
UINT8 InitRootDevice( UINT8 RootHubIndex ); // Initialize the USB device of the designated ROOT-HUB port
// Input: Built-in HUB port number 0/1
UINT8 EnumAllRootDevice( void ); // Enumerate all USB devices of ROOT-HUB port
UINT8 InitDevOnHub( UINT8 RootHubIndex, UINT8 HubPortIndex ); // Initialize the secondary USB device after enumerating external HUB
UINT8 EnumHubPort( UINT8 RootHubIndex ); // Enumerate each port of the external HUB hub on the specified ROOT-HUB port, check whether each port is connected or remove the event and initialize the secondary USB device
UINT8 EnumAllHubPort( void ); // Enumerate all secondary USB devices behind the external HUB under the ROOT-HUB port
UINT16 SearchTypeDevice( UINT8 type ); // Search for the port number where the device of the specified type is located on each port of ROOT-HUB and external HUB. If the output port number is 0xFFFF, it is not found
// The upper 8 bits of the output are the ROOT-HUB port number, the lower 8 bits are the port number of the external HUB, and the lower 8 bits are 0, the device is directly on the ROOT-HUB port
void mInitSTDIO( void ); // Initialize the serial port for printf and getkey input and output
void InitUSB_Host( void ); // Initialize the USB host
//#define FREQ_SYS 12000000 // System frequency is 12MHz
/************************************************* ******************************
* Function Name: mDelayus(UNIT16 n)
* Description: us delay function
* Input: UNIT16 n
* Output: None
* Return: None
************************************************** *****************************/
void mDelayuS( UINT16 n) // Delay in uS
{
    while (n) // total = 12~13 Fsys cycles, 1uS @Fsys=12MHz
    {
        ++ SAFE_MOD; // 2 Fsys cycles, for higher Fsys, add operation here
#ifdef FREQ_SYS
#if FREQ_SYS >= 14000000
        ++ SAFE_MOD;
#endif
#if FREQ_SYS >= 16000000
        ++ SAFE_MOD;
#endif
#if FREQ_SYS >= 18000000
        ++ SAFE_MOD;
#endif
#if FREQ_SYS >= 20000000
        ++ SAFE_MOD;
#endif
#if FREQ_SYS >= 22000000
        ++ SAFE_MOD;
#endif
#if FREQ_SYS >= 24000000
        ++ SAFE_MOD;
#endif
#if FREQ_SYS >= 26000000
        ++ SAFE_MOD;
#endif
#if FREQ_SYS >= 28000000
        ++ SAFE_MOD;
#endif
#if FREQ_SYS >= 30000000
        ++ SAFE_MOD;
#endif
#if FREQ_SYS >= 32000000
        ++ SAFE_MOD;
#endif
#if FREQ_SYS >= 34000000
        ++ SAFE_MOD;
#endif
#if FREQ_SYS >= 36000000
        ++ SAFE_MOD;
#endif
#if FREQ_SYS >= 38000000
        ++ SAFE_MOD;
#endif
#if FREQ_SYS >= 40000000
        ++ SAFE_MOD;
#endif
#endif
        - n;
    }
}
/************************************************* ******************************
* Function Name: mDelayms(UNIT16 n)
* Description: ms delay function
* Input: UNIT16 n
* Output: None
* Return: None
************************************************** *****************************/
void mDelaymS( UINT16 n) // Delay in mS
{
    while (n)
    {
        mDelayuS( 1000 );
        - n;
    }
}
/************************************************* ******************************
* Function Name: DisableRootHubPort(UINT8 RootHubIndex)
* Description: Close the HUB port
* Input: UINT8 RootHubIndex specifies the ROOT_HUB port
* Output: None
* Return: None
************************************************** *****************************/
void DisableRootHubPort( UINT8 RootHubIndex) // Close the specified ROOT-HUB port, in fact the hardware has been automatically closed, here is just to clear some structure states
{
    RootHubDev[ RootHubIndex ].DeviceStatus = ROOT_DEV_DISCONNECT;
    RootHubDev[ RootHubIndex ].DeviceAddress = 0x00;
    if (RootHubIndex == 1)
    {
        UHUB1_CTRL = 0x00; // Clear the control data related to HUB1, actually does not need to be cleared
    }
    else
    {
        UHUB0_CTRL = 0x00; // Clear the control data related to HUB0, actually does not need to be cleared
    }
}
/************************************************* ******************************
* Function Name: AnalyzeRootHub(void)
* Description: Analyze the ROOT-HUB status and handle the ROOT-HUB port device plug-in event
                   If the device is unplugged, call the DisableRootHubPort() function in the function to close the port, insert the event, and set the status bit of the corresponding port
* Input: None
* Output: None
* Return: Return ERR_SUCCESS for no condition, return ERR_USB_CONNECT for new connection detected, return ERR_USB_DISCON for disconnection detected
************************************************** *****************************/
UINT8 AnalyzeRootHub( void)
{
    UINT8 s;
    s = ERR_SUCCESS;
    if (USB_HUB_ST & bUHS_H0_ATTACH) // device exists, HUB0
    {
        if (RootHubDev[0].DeviceStatus == ROOT_DEV_DISCONNECT // Detected device insertion
                || (UHUB0_CTRL & bUH_PORT_EN) == 0x00) // Device insertion is detected, but it has not been allowed, indicating that it has just been inserted
        {
            DisableRootHubPort( 0 ); // Close the port
// RootHubDev[0].DeviceSpeed ​​= USB_HUB_ST & bUHS_DM_LEVEL? 0: 1;
            RootHubDev[0].DeviceStatus = ROOT_DEV_CONNECTED; //Set connection flag
            printf( "HUB 0 dev in\n" );
            s = ERR_USB_CONNECT;
        }
    }
    else if (RootHubDev[0].DeviceStatus >= ROOT_DEV_CONNECTED )//The device is unplugged
    {
        DisableRootHubPort( 0 ); // Close the port
        printf( "HUB 0 dev out\n" );
        //UH_SETUP &= ~bUH_SOF_EN;
        if (s == ERR_SUCCESS)
        {
            s = ERR_USB_DISCON; //Set device disconnect flag
        }
    }
    if (USB_HUB_ST & bUHS_H1_ATTACH) // device exists, HUB1
    {
        if (RootHubDev[1].DeviceStatus == ROOT_DEV_DISCONNECT // Detected device insertion
                || (UHUB1_CTRL & bUH_PORT_EN) == 0x00) // Device insertion is detected, but it has not been allowed, indicating that it has just been inserted
        {
            DisableRootHubPort( 1 ); // Close the port
// RootHubDev[1].DeviceSpeed ​​= USB_HUB_ST & bUHS_HM_LEVEL? 0: 1;
            RootHubDev[1].DeviceStatus = ROOT_DEV_CONNECTED; //Set connection flag
            printf( "HUB 1 dev in\n" );
            s = ERR_USB_CONNECT;
        }
    }
    else if (RootHubDev[1].DeviceStatus >= ROOT_DEV_CONNECTED )//The device is unplugged
    {
        DisableRootHubPort( 1 ); // Close the port
        //UH_SETUP &= ~bUH_SOF_EN;
        printf( "HUB 1 dev out\n" );
        if (s == ERR_SUCCESS)
        {
            s = ERR_USB_DISCON;
        }
    }
// UIF_DETECT = 0; // Clear connection interruption flag
    return( s );
}
/************************************************* ******************************
* Function Name: SetHostUsbAddr
* Description: Set the USB device address currently operated by the USB host
* Input: UINT8 addr
* Output: None
* Return: None
************************************************** *****************************/
void SetHostUsbAddr( UINT8 addr)
{
    USB_DEV_AD = USB_DEV_AD & bUDA_GP_BIT | addr & 0x7F;
}
/************************************************* ******************************
* Function Name: SetUsbSpeed
* Description: Set the current USB speed
* Input: UINT8 FullSpeed
* Output: None
* Return: None
************************************************** *****************************/
void SetUsbSpeed( UINT8 FullSpeed)
{
    if (FullSpeed) // full speed
    {
        USB_CTRL &= ~ bUC_LOW_SPEED; // Full speed
        UH_SETUP &= ~ bUH_PRE_PID_EN; // prohibit PRE PID
    }
    else
    {
        USB_CTRL |= bUC_LOW_SPEED; // Low speed
    }
}
/************************************************* ******************************
* Function Name: ResetRootHubPort( UINT8 RootHubIndex)
* Description: After the device is detected, reset the bus to prepare for enumerating the device, and set it to default to full speed
* Input: UINT8 RootHubIndex designated port
* Output: None
* Return: None
************************************************** *****************************/
void ResetRootHubPort( UINT8 RootHubIndex)
{
    UsbDevEndp0Size = DEFAULT_ENDP0_SIZE; //Maximum packet size of endpoint 0 of the USB device
    SetHostUsbAddr( 0x00 );
    SetUsbSpeed( 1 ); // The default is full speed
    if (RootHubIndex == 1)
    {
        UHUB1_CTRL = UHUB1_CTRL & ~ bUH_LOW_SPEED | bUH_BUS_RESET;// The default is full speed, start reset
        mDelaymS( 15 ); // reset time 10mS to 20mS
        UHUB1_CTRL = UHUB1_CTRL & ~ bUH_BUS_RESET; // end reset
    }
    else
    {
        UHUB0_CTRL = UHUB0_CTRL & ~ bUH_LOW_SPEED | bUH_BUS_RESET;// The default is full speed, start reset
        mDelaymS( 15 ); // reset time 10mS to 20mS
        UHUB0_CTRL = UHUB0_CTRL & ~ bUH_BUS_RESET; // end reset
    }
    mDelayuS( 250 );
    UIF_DETECT = 0; // Clear interrupt flag
}
/************************************************* ******************************
* Function Name: EnableRootHubPort( UINT8 RootHubIndex)
* Description: Enable the ROOT-HUB port, and the corresponding bUH_PORT_EN is set to 1 to enable the port. The device disconnection may cause the return failure
* Input: UINT8 RootHubIndex designated port
* Output: None
* Return: Return ERR_SUCCESS to detect a new connection, return ERR_USB_DISCON to indicate no connection
************************************************** *****************************/
UINT8 EnableRootHubPort( UINT8 RootHubIndex)
{
    if (RootHubDev[ RootHubIndex ].DeviceStatus <ROOT_DEV_CONNECTED)
    {
        RootHubDev[ RootHubIndex ].DeviceStatus = ROOT_DEV_CONNECTED;
    }
    if (RootHubIndex == 1)
    {
        if (USB_HUB_ST & bUHS_H1_ATTACH) // HUB1 has equipment
        {
            if ((UHUB1_CTRL & bUH_PORT_EN) == 0x00) // not yet enabled
            {
                RootHubDev[1].DeviceSpeed ​​= USB_HUB_ST & bUHS_HM_LEVEL? 0: 1;
                if (RootHubDev[1].DeviceSpeed ​​== 0)
                {
                    UHUB1_CTRL |= bUH_LOW_SPEED; // Low speed
                }
            }
            UHUB1_CTRL |= bUH_PORT_EN; //Enable HUB1 port
            return( ERR_SUCCESS );
        }
    }
    else
    {
        if (USB_HUB_ST & bUHS_H0_ATTACH) // HUB0 has equipment
        {
            if ((UHUB0_CTRL & bUH_PORT_EN) == 0x00) // not yet enabled
            {
                RootHubDev[0].DeviceSpeed ​​= USB_HUB_ST & bUHS_DM_LEVEL? 0: 1;
                if (RootHubDev[0].DeviceSpeed ​​== 0)
                {
                    UHUB0_CTRL |= bUH_LOW_SPEED; // Low speed
                }
            }
            UHUB0_CTRL |= bUH_PORT_EN; //Enable HUB0 port
            return( ERR_SUCCESS );
        }
    }
    return( ERR_USB_DISCON );
}
/************************************************* ******************************
* Function Name: SelectHubPort( UINT8 RootHubIndex, UINT8 HubPortIndex)
* Description: Select the HUB port to be operated
* Input: UINT8 RootHubIndex HubPortIndex=0 to select the designated ROOT-HUB port for operation, otherwise select the designated port of the external HUB for the designated ROOT-HUB port
                   UINT8 HubPortIndex Select the designated port of the external HUB that operates the designated ROOT-HUB port
* Output: None
* Return: None
************************************************** *****************************/
void SelectHubPort( UINT8 RootHubIndex, UINT8 HubPortIndex)
{
    if (HubPortIndex) // Select the designated port of the external HUB that operates the designated ROOT-HUB port
    {
        SetHostUsbAddr( DevOnHubPort[RootHubIndex][HubPortIndex-1].DeviceAddress );// Set the USB device address currently operated by the USB host
        SetUsbSpeed( DevOnHubPort[RootHubIndex][HubPortIndex-1].DeviceSpeed ​​);// Set the current USB speed
        if (DevOnHubPort[RootHubIndex][HubPortIndex-1].DeviceSpeed ​​== 0 )// The front ID is required to communicate with low-speed USB devices through an external HUB
        {
            UH_SETUP |= bUH_PRE_PID_EN; // enable PRE PID
            mDelayuS(100);
        }
    }
    else // Select the ROOT-HUB port specified by the operation
    {
        SetHostUsbAddr( RootHubDev[RootHubIndex].DeviceAddress );// Set the USB device address currently operated by the USB host
        SetUsbSpeed( RootHubDev[RootHubIndex].DeviceSpeed ​​); // Set the current USB speed
    }
    RootHubId = RootHubIndex? 1: 0;
}
/************************************************* ******************************
* Function Name: WaitUSB_Interrupt
* Description: Wait for USB interrupt
* Input: None
* Output: None
* Return: return ERR_SUCCESS data received or sent successfully
                   ERR_USB_UNKNOWN Data receiving or sending failed
************************************************** *****************************/
UINT8 WaitUSB_Interrupt( void)
{
    UINT16 i;
    for (i = WAIT_USB_TOUT_200US; i != 0 && UIF_TRANSFER == 0; i -)
    {
        ;
    }
    return( UIF_TRANSFER? ERR_SUCCESS: ERR_USB_UNKNOWN );
}
/************************************************* ******************************
* Function Name: USBHostTransact
* Description: CH559 transmission transaction, enter the destination endpoint address/PID token, synchronization flag, the total NAK retry time in units of 20uS (0 means no retry, 0xFFFF unlimited retry), return 0 success, timeout/error retry test
                   This subroutine focuses on easy to understand, and in actual applications, in order to provide running speed, the code of this subroutine should be optimized
* Input: UINT8 endp_pid token and address endp_pid: the upper 4 bits are the token_pid token, the lower 4 bits are the endpoint address
                   UINT8 tog synchronization flag
                   UINT16 timeout timeout
* Output: None
* Return: ERR_USB_UNKNOWN timed out, the hardware may be abnormal
                   ERR_USB_DISCON Device disconnect
                   ERR_USB_CONNECT Device connection
                   ERR_SUCCESS transfer completed
************************************************** *****************************/
UINT8 USBHostTransact( UINT8 endp_pid, UINT8 tog, UINT16 timeout)
{
    UINT8 TransRetry;
// #define TransRetry UEP0_T_LEN // Save memory
    UINT8 s, r;
    UINT16 i;
    UH_RX_CTRL = tog;
    UH_TX_CTRL =tog;
    TransRetry = 0;
    do
    {
// LED_TMP = 0;
        UH_EP_PID = endp_pid; // Specify the token PID and destination endpoint number
        UIF_TRANSFER = 0; // Allow transmission
// s = WaitUSB_Interrupt( );
        for (i = WAIT_USB_TOUT_200US; i != 0 && UIF_TRANSFER == 0; i -)
        {
            ;
        }
        UH_EP_PID = 0x00; // Stop USB transmission
// LED_TMP = 1;
// if (s != ERR_SUCCESS) return( s ); // interrupt timeout, it may be a hardware exception
        if (UIF_TRANSFER == 0)
        {
            return( ERR_USB_UNKNOWN );
        }
// if (UIF_DETECT) // USB device plug-in event
// {
// // mDelayuS( 200 ); // wait for the transfer to complete
// // UIF_DETECT = 0; // Clear interrupt flag
// s = AnalyzeRootHub( ); // Analyze ROOT-HUB status
// if (s == ERR_USB_CONNECT)
// {
// FoundNewDev = 1;
//}
// if ((RootHubDev[RootHubId].DeviceStatus == ROOT_DEV_DISCONNECT)||(CH559DiskStatus == DISK_DISCONNECT))
// {
// return( ERR_USB_DISCON ); // USB device disconnect event
//}
// if ((RootHubDev[RootHubId].DeviceStatus == ROOT_DEV_CONNECTED)||(CH559DiskStatus == DISK_CONNECT))
// {
// return( ERR_USB_CONNECT ); // USB device connection event
//}
// // if ((USB_HUB_ST & bUHS_H0_ATTACH) == 0x00) return( ERR_USB_DISCON );// USB device disconnect event
// mDelayuS( 200 ); // Wait for the transfer to complete
//}
        if (UIF_TRANSFER) // transfer completed
        {
            if (U_TOG_OK)
            {
                return( ERR_SUCCESS );
            }
            r = USB_INT_ST & MASK_UIS_H_RES; // USB device response status
            if (r == USB_PID_STALL)
            {
                return( r | ERR_USB_TRANSFER );
            }
            if (r == USB_PID_NAK)
            {
                if (timeout == 0)
                {
                    return( r | ERR_USB_TRANSFER );
                }
                if (timeout <0xFFFF)
                {
                    timeout --;
                }
                - TransRetry;
            }
            else switch (endp_pid >> 4)
                {
                case USB_PID_SETUP:
                case USB_PID_OUT:
                    if (U_TOG_OK)
                    {
                        return( ERR_SUCCESS );
                    }
                    if (r == USB_PID_ACK)
                    {
                        return( ERR_SUCCESS );
                    }
                    if (r == USB_PID_STALL || r == USB_PID_NAK)
                    {
                        return( r | ERR_USB_TRANSFER );
                    }
                    if (r)
                    {
                        return( r | ERR_USB_TRANSFER ); // Not a timeout/error, unexpected response
                    }
                    break; // Retry after timeout
                case USB_PID_IN:
                    if (U_TOG_OK)
                    {
                        return( ERR_SUCCESS );
                    }
                    if (tog? r == USB_PID_DATA1: r == USB_PID_DATA0)
                    {
                        return( ERR_SUCCESS );
                    }
                    if (r == USB_PID_STALL || r == USB_PID_NAK)
                    {
                        return( r | ERR_USB_TRANSFER );
                    }
                    if (r == USB_PID_DATA0 && r == USB_PID_DATA1 )// If out of sync, you need to discard and try again
                    {
                    } // Retry without synchronization
                    else if (r)
                    {
                        return( r | ERR_USB_TRANSFER ); // Not a timeout/error, unexpected response
                    }
                    break; // Retry after timeout
                default:
                    return( ERR_USB_UNKNOWN ); // impossible situation
                    break;
                }
        }
        else // other interrupts, things that shouldn't happen
        {
            USB_INT_FG = 0xFF; //Clear interrupt flag
        }
        mDelayuS( 15 );
    }
    while (++ TransRetry <3 );
    return( ERR_USB_TRANSFER ); // response timeout
}
/************************************************* ******************************
* Function Name: HostCtrlTransfer
* Description: Perform control transmission, the 8-byte request code is in pSetupReq, and DataBuf is an optional transceiver buffer
* Input: PUINT8X DataBuf If you need to receive and send data, then DataBuf needs to point to a valid buffer for storing subsequent data
                   The total length of PUINT8 RetLen actually successfully sent and received is stored in the byte variable pointed to by RetLen
* Output: None
* Return: ERR_USB_BUF_OVER IN state phase error
                   ERR_SUCCESS Data exchange is successful
                   Other error status
************************************************** *****************************/
UINT8 HostCtrlTransfer( PUINT8 DataBuf, PUINT8 RetLen)
{
    UINT16 RemLen = 0;
    UINT8 s, RxLen, RxCnt, TxCnt;
    PUINT8 pBuf;
    PUINT8 xdata pLen;
    pBuf = DataBuf;
    pLen = RetLen;
    mDelayuS( 200 );
    if (pLen)
    {
        *pLen = 0; // The total length of actual successful sending and receiving
    }
    UH_TX_LEN = sizeof( USB_SETUP_REQ );
    s = USBHostTransact( USB_PID_SETUP << 4 | 0x00, 0x00, 200000/20 ); // SETUP phase, 200mS timeout
    if (s != ERR_SUCCESS)
    {
        return( s );
    }
    UH_RX_CTRL = UH_TX_CTRL = bUH_R_TOG | bUH_R_AUTO_TOG | bUH_T_TOG | bUH_T_AUTO_TOG;// Default DATA1
    UH_TX_LEN = 0x01; // There is no data by default, so the status stage is IN
    RemLen = (pSetupReq -> wLengthH << 8)|( pSetupReq -> wLengthL);
    if (RemLen && pBuf) // Need to send and receive data
    {
