crowdwave/ch559samplestranslated/EVT/EXAM/USB/Host/USBH_HUB_KM.C
        if (pSetupReq -> bRequestType & USB_REQ_TYP_IN) // accept
        {
            while (RemLen)
            {
                mDelayuS( 200 );
                s = USBHostTransact( USB_PID_IN << 4 | 0x00, UH_RX_CTRL, 200000/20 );// IN data
                if (s != ERR_SUCCESS)
                {
                    return( s );
                }
                RxLen = USB_RX_LEN <RemLen? USB_RX_LEN: RemLen;
                RemLen -= RxLen;
                if (pLen)
                {
                    *pLen += RxLen; // The total length of actual successful sending and receiving
                }
// memcpy( pBuf, RxBuffer, RxLen );
// pBuf += RxLen;
                for (RxCnt = 0; RxCnt != RxLen; RxCnt ++)
                {
                    *pBuf = RxBuffer[ RxCnt ];
                    pBuf ++;
                }
                if (USB_RX_LEN == 0 || (USB_RX_LEN & (UsbDevEndp0Size-1)))
                {
                    break; // short package
                }
            }
            UH_TX_LEN = 0x00; // The status phase is OUT
        }
        else // send
        {
            while (RemLen)
            {
                mDelayuS( 200 );
                UH_TX_LEN = RemLen >= UsbDevEndp0Size? UsbDevEndp0Size: RemLen;
// memcpy( TxBuffer, pBuf, UH_TX_LEN );
// pBuf += UH_TX_LEN;
                if(pBuf[1] == 0x09) //HID command processing
                {
                    Set_Port = Set_Port^1? 1:0;
                    *pBuf = Set_Port;
                    printf("SET_PORT %02X %02X ",(UINT16)(*pBuf),(UINT16)(Set_Port));
                }
                for (TxCnt = 0; TxCnt != UH_TX_LEN; TxCnt ++)
                {
                    TxBuffer[ TxCnt] = *pBuf;
                    pBuf ++;
                }
                s = USBHostTransact( USB_PID_OUT << 4 | 0x00, UH_TX_CTRL, 200000/20 );// OUT data
                if (s != ERR_SUCCESS)
                {
                    return( s );
                }
                RemLen -= UH_TX_LEN;
                if (pLen)
                {
                    *pLen += UH_TX_LEN; // The total length of actual successful sending and receiving
                }
            }
// UH_TX_LEN = 0x01; // Status phase is IN
        }
    }
    mDelayuS( 200 );
    s = USBHostTransact( (UH_TX_LEN? USB_PID_IN << 4 | 0x00: USB_PID_OUT << 4 | 0x00 ), bUH_R_TOG | bUH_T_TOG, 200000/20 ); // STATUS stage
    if (s != ERR_SUCCESS)
    {
        return( s );
    }
    if (UH_TX_LEN == 0)
    {
        return( ERR_SUCCESS ); // status OUT
    }
    if (USB_RX_LEN == 0)
    {
        return( ERR_SUCCESS ); // Status IN, check the IN status and return data length
    }
    return( ERR_USB_BUF_OVER ); // Error in IN state stage
}
/************************************************* ******************************
* Function Name: CopySetupReqPkg
* Description: Copy control transmission request packet
* Input: PUINT8C pReqPkt control request packet address
* Output: None
* Return: None
************************************************** *****************************/
void CopySetupReqPkg( PUINT8C pReqPkt) // copy control transmission request packet
{
    UINT8 i;
    for (i = 0; i != sizeof( USB_SETUP_REQ ); i ++)
    {
        ((PUINT8X)pSetupReq)[ i] = *pReqPkt;
        pReqPkt ++;
    }
}
/************************************************* ******************************
* Function Name: CtrlGetDeviceDescr
* Description: Get the device descriptor and return it in TxBuffer
* Input: None
* Output: None
* Return: ERR_USB_BUF_OVER Descriptor length error
                   ERR_SUCCESS success
                   other
************************************************** *****************************/
UINT8 CtrlGetDeviceDescr( void)
{
    UINT8 s;
    UINT8 len;
    UsbDevEndp0Size = DEFAULT_ENDP0_SIZE;
    CopySetupReqPkg( SetupGetDevDescr );
    s = HostCtrlTransfer( TxBuffer, &len ); // Perform control transfer
    if (s != ERR_SUCCESS)
    {
        return( s );
    }
    UsbDevEndp0Size = ((PXUSB_DEV_DESCR)TxBuffer) -> bMaxPacketSize0;// The maximum packet length of endpoint 0, which is simplified processing. Normally, you should get the first 8 bytes and immediately update UsbDevEndp0Size before continuing
    if (len <((PUSB_SETUP_REQ)SetupGetDevDescr) -> wLengthL)
    {
        return( ERR_USB_BUF_OVER ); // Descriptor length error
    }
    return( ERR_SUCCESS );
}
/************************************************* ******************************
* Function Name: CtrlGetConfigDescr
* Description: Get the configuration descriptor and return it in TxBuffer
* Input: None
* Output: None
* Return: ERR_USB_BUF_OVER Descriptor length error
                   ERR_SUCCESS success
                   other
************************************************** *****************************/
UINT8 CtrlGetConfigDescr( void)
{
    UINT8 s;
    UINT8D len;
    CopySetupReqPkg( SetupGetCfgDescr );
    s = HostCtrlTransfer( TxBuffer, &len ); // Perform control transfer
    if (s != ERR_SUCCESS)
    {
        return( s );
    }
    if (len <((PUSB_SETUP_REQ)SetupGetCfgDescr) -> wLengthL)
    {
        return( ERR_USB_BUF_OVER ); // Return length error
    }
    len = ((PXUSB_CFG_DESCR)TxBuffer) -> wTotalLengthL;
    CopySetupReqPkg( SetupGetCfgDescr );
    pSetupReq -> wLengthL = len; // The total length of the complete configuration descriptor
    s = HostCtrlTransfer( TxBuffer, &len ); // Perform control transfer
    if (s != ERR_SUCCESS)
    {
        return( s );
    }
    if (len <((PUSB_SETUP_REQ)SetupGetCfgDescr) -> wLengthL || len <((PXUSB_CFG_DESCR)TxBuffer) -> wTotalLengthL)
    {
        return( ERR_USB_BUF_OVER ); // Descriptor length error
    }
    return( ERR_SUCCESS );
}
/************************************************* ******************************
* Function Name: CtrlSetUsbAddress
* Description: Set the USB device address
* Input: UINT8 addr device address
* Output: None
* Return: ERR_SUCCESS success
                   other
************************************************** *****************************/
UINT8 CtrlSetUsbAddress( UINT8 addr)
{
    UINT8 s;
    CopySetupReqPkg( SetupSetUsbAddr );
    pSetupReq -> wValueL = addr; // USB device address
    s = HostCtrlTransfer( NULL, NULL ); // Perform control transfer
    if (s != ERR_SUCCESS)
    {
        return( s );
    }
    SetHostUsbAddr( addr ); // Set the USB device address currently operated by the USB host
    mDelaymS( 10 ); // Wait for the USB device to complete the operation
    return( ERR_SUCCESS );
}
/************************************************* ******************************
* Function Name: CtrlSetUsbConfig
* Description: Set USB device configuration
* Input: UINT8 cfg configuration value
* Output: None
* Return: ERR_SUCCESS success
                   other
************************************************** *****************************/
UINT8 CtrlSetUsbConfig( UINT8 cfg)
{
    CopySetupReqPkg( SetupSetUsbConfig );
    pSetupReq -> wValueL = cfg; // USB device configuration
    return( HostCtrlTransfer( NULL, NULL) ); // Perform control transfer
}
/************************************************* ******************************
* Function Name: CtrlSetUsbIDLE
* Description: Set USB device configuration
* Input: UINT8 cfg configuration value
* Output: None
* Return: ERR_SUCCESS success
                   other
************************************************** *****************************/
UINT8 CtrlSetUsbIDLE( UINT8 idle)
{
    CopySetupReqPkg( SetupSetUsbIDLE );
    pSetupReq -> wIndexL = idle; // USB device configuration
    return( HostCtrlTransfer( NULL, NULL) ); // Perform control transfer
}
/************************************************* ******************************
* Function Name: CtrlSetUsbIntercace
* Description: Set the USB device interface
* Input: UINT8 cfg configuration value
* Output: None
* Return: ERR_SUCCESS success
                   other
************************************************** *****************************/
UINT8 CtrlSetUsbIntercace( UINT8 cfg)
{
    CopySetupReqPkg( SetupSetUsbInterface );
    pSetupReq -> wValueL = cfg; // USB device configuration
    return( HostCtrlTransfer( NULL, NULL) ); // Perform control transfer
}
/************************************************* ******************************
* Function Name: CtrlClearEndpStall
* Description: Clear endpoint STALL
* Input: UINT8 endp endpoint address
* Output: None
* Return: ERR_SUCCESS success
                   other
************************************************** *****************************/
UINT8 CtrlClearEndpStall( UINT8 endp)
{
    CopySetupReqPkg( SetupClrEndpStall ); // Clear the error of the endpoint
    pSetupReq -> wIndexL = endp; // endpoint address
    return( HostCtrlTransfer( NULL, NULL) ); // Perform control transfer
}
/************************************************* ******************************
* Function Name: CtrlGetHIDDeviceReport
* Description: Get the HID device report descriptor and return it in TxBuffer
* Input: None
* Output: None
* Return: ERR_SUCCESS success
                   Other errors
************************************************** *****************************/
UINT8 CtrlGetHIDDeviceReport( void)
{
    UINT8 s;
    UINT8 len;
    UINT8 tmp[]= {0x21,0x0a,0x00,0x00,0x00,0x00,0x00,0x00};
    for (s = 0; s != sizeof( tmp ); s ++)
    {
        ((PUINT8X)pSetupReq)[ s] = tmp[s];
    }
    s = HostCtrlTransfer( TxBuffer, &len ); // Perform control transfer
// if (s != ERR_SUCCESS)
// {
// return( s );
//}
    CopySetupReqPkg( SetupGetHIDDevReport );
    s = HostCtrlTransfer( TxBuffer, &len ); // Perform control transfer
    if (s != ERR_SUCCESS)
    {
        return( s );
    }
    if (len <((PUSB_SETUP_REQ)SetupGetDevDescr) -> wLengthL)
    {
        return( ERR_USB_BUF_OVER ); // Descriptor length error
    }
    return( ERR_SUCCESS );
}
/************************************************* ******************************
* Function Name: CtrlGetHubDescr
* Description: Get the HUB descriptor and return it in TxBuffer
* Input: None
* Output: None
* Return: ERR_SUCCESS success
                   ERR_USB_BUF_OVER Length error
************************************************** *****************************/
UINT8 CtrlGetHubDescr( void)
{
    UINT8 s;
    UINT8D len;
    CopySetupReqPkg( SetupGetHubDescr );
    s = HostCtrlTransfer( TxBuffer, &len ); // Perform control transfer
    if (s != ERR_SUCCESS)
    {
        return( s );
    }
    if (len <((PUSB_SETUP_REQ)SetupGetHubDescr) -> wLengthL)
    {
        return( ERR_USB_BUF_OVER ); // Descriptor length error
    }
// if (len <4) return( ERR_USB_BUF_OVER ); // Descriptor length error
    return( ERR_SUCCESS );
}
/************************************************* ******************************
* Function Name: HubGetPortStatus
* Description: Query the status of the HUB port and return it in TxBuffer
* Input: UINT8 HubPortIndex
* Output: None
* Return: ERR_SUCCESS success
                   ERR_USB_BUF_OVER Length error
************************************************** *****************************/
UINT8 HubGetPortStatus( UINT8 HubPortIndex)
{
    UINT8 s;
    UINT8D len;
    pSetupReq -> bRequestType = HUB_GET_PORT_STATUS;
    pSetupReq -> bRequest = HUB_GET_STATUS;
    pSetupReq -> wValueL = 0x00;
    pSetupReq -> wValueH = 0x00;
    pSetupReq -> wIndexL = HubPortIndex;
    pSetupReq -> wIndexH = 0x00;
    pSetupReq -> wLengthL = 0x04;
    pSetupReq -> wLengthH = 0x00;
    s = HostCtrlTransfer( TxBuffer, &len ); // Perform control transfer
    if (s != ERR_SUCCESS)
    {
        return( s );
    }
    if (len <4)
    {
        return( ERR_USB_BUF_OVER ); // Descriptor length error
    }
    return( ERR_SUCCESS );
}
/************************************************* ******************************
* Function Name: HubSetPortFeature
* Description: Set HUB port characteristics
* Input: UINT8 HubPortIndex //HUB port
                   UINT8 FeatureSelt //HUB port feature
* Output: None
* Return: ERR_SUCCESS success
                   Other errors
************************************************** *****************************/
UINT8 HubSetPortFeature( UINT8 HubPortIndex, UINT8 FeatureSelt)
{
    pSetupReq -> bRequestType = HUB_SET_PORT_FEATURE;
    pSetupReq -> bRequest = HUB_SET_FEATURE;
    pSetupReq -> wValueL = FeatureSelt;
    pSetupReq -> wValueH = 0x00;
    pSetupReq -> wIndexL = HubPortIndex;
    pSetupReq -> wIndexH = 0x00;
    pSetupReq -> wLengthL = 0x00;
    pSetupReq -> wLengthH = 0x00;
    return( HostCtrlTransfer( NULL, NULL) ); // Perform control transfer
}
/************************************************* ******************************
* Function Name: HubClearPortFeature
* Description: Clear HUB port characteristics
* Input: UINT8 HubPortIndex //HUB port
                   UINT8 FeatureSelt //HUB port feature
* Output: None
* Return: ERR_SUCCESS success
                   Other errors
************************************************** *****************************/
UINT8 HubClearPortFeature( UINT8 HubPortIndex, UINT8 FeatureSelt)
{
    pSetupReq -> bRequestType = HUB_CLEAR_PORT_FEATURE;
    pSetupReq -> bRequest = HUB_CLEAR_FEATURE;
    pSetupReq -> wValueL = FeatureSelt;
    pSetupReq -> wValueH = 0x00;
    pSetupReq -> wIndexL = HubPortIndex;
    pSetupReq -> wIndexH = 0x00;
    pSetupReq -> wLengthL = 0x00;
    pSetupReq -> wLengthH = 0x00;
    return( HostCtrlTransfer( NULL, NULL) ); // Perform control transfer
}
/************************************************* ******************************
* Function Name: CtrlGetXPrinterReport1
* Description: Printer command
* Input: None
* Output: None
* Return: ERR_USB_BUF_OVER Descriptor length error
                   ERR_SUCCESS success
                   other
************************************************** *****************************/
UINT8 CtrlGetXPrinterReport1( void)
{
    UINT8 s;
    UINT16 len;
    CopySetupReqPkg( XPrinterReport );
    s = HostCtrlTransfer( TxBuffer, &len ); // Perform control transfer
    if (s != ERR_SUCCESS)
    {
        return( s );
    }
    if (len <((XPrinterReport[7]<<8)|(XPrinterReport[6]) ))
    {
        return( ERR_USB_BUF_OVER ); // Descriptor length error
    }
    return( ERR_SUCCESS );
}
/************************************************* ******************************
* Function Name: AnalyzeHidIntEndp
* Description: Analyze the address of the HID interrupt endpoint from the descriptor
* Input: PUINT8X buf buffer address of data to be analyzed
* Output: None
* Return: interrupt endpoint address
************************************************** *****************************/
UINT8 AnalyzeHidIntEndp( PUINT8X buf)
{
    UINT8 i, s, l;
    s = 0;
    for (i = 0; i <((PXUSB_CFG_DESCR)buf) -> wTotalLengthL; i += l) // search interrupt endpoint descriptor, skip configuration descriptor and interface descriptor
    {
        if (((PXUSB_ENDP_DESCR)(buf+i)) -> bDescriptorType == USB_DESCR_TYP_ENDP // is the endpoint descriptor
                && (((PXUSB_ENDP_DESCR)(buf+i)) -> bmAttributes & USB_ENDP_TYPE_MASK) == USB_ENDP_TYPE_INTER// is the interrupt endpoint
                && (((PXUSB_ENDP_DESCR)(buf+i)) -> bEndpointAddress & USB_ENDP_DIR_MASK) )// is the IN endpoint
        {
            s = ((PXUSB_ENDP_DESCR)(buf+i)) -> bEndpointAddress & USB_ENDP_ADDR_MASK;// The address of the interrupt endpoint
            break; // You can save wMaxPacketSize and bInterval as needed
        }
        l = ((PXUSB_ENDP_DESCR)(buf+i)) -> bLength; // current descriptor length, skip
        if (l> 16)
        {
            break;
        }
    }
    return( s );
}
/************************************************* ******************************
* Function Name: InitRootDevice
* Description: Initialize the USB device of the designated ROOT-HUB port
* Input: UINT8 RootHubIndex designated port, built-in HUB port number 0/1
* Output: None
* Return:
************************************************** *****************************/
UINT8 InitRootDevice( UINT8 RootHubIndex)
{
    UINT8 i, s, cfg, dv_cls, if_cls;
    UINT8 retry=0;
    printf( "Reset root hub %1d# port\n", (UINT16)RootHubIndex );
    while(retry<10)
    {
        mDelaymS( 100*retry );
        retry++;
        ResetRootHubPort( RootHubIndex ); // After detecting the device, reset the USB bus of the corresponding port
        for (i = 0, s = 0; i <100; i ++) // wait for the USB device to reset and reconnect, 100mS timeout
        {
            mDelaymS( 1 );
            if (EnableRootHubPort( RootHubIndex) == ERR_SUCCESS) // Enable ROOT-HUB port
            {
                i = 0;
                s ++; // Time to wait for the stability of the USB device connection
                if (s> 10*retry)
                {
                    break; // 15mS has been connected stably
                }
            }
        }
        if (i) // device is not connected after reset
        {
            DisableRootHubPort( RootHubIndex );
            printf( "Disable root hub %1d# port because of disconnect\n", (UINT16)RootHubIndex );
// return( ERR_USB_DISCON );
            continue;
        }
        SelectHubPort( RootHubIndex, 0 );
        printf( "GetDevDescr: ");
        s = CtrlGetDeviceDescr( ); // Get device descriptor
        if (s == ERR_SUCCESS)
        {
            for (i = 0; i <((PUSB_SETUP_REQ)SetupGetDevDescr) -> wLengthL; i ++)
            {
                printf( "x%02X ", (UINT16)( TxBuffer[i]) );
            }
            printf( "\n" ); // display the descriptor
            dv_cls = ((PXUSB_DEV_DESCR)TxBuffer) -> bDeviceClass; // device class code
            s = CtrlSetUsbAddress( RootHubIndex + ((PUSB_SETUP_REQ)SetupSetUsbAddr) -> wValueL );// Set the USB device address, plus RootHubIndex can ensure that the 2 HUB ports are assigned different addresses
            if (s == ERR_SUCCESS)
            {
                RootHubDev[RootHubIndex].DeviceAddress = RootHubIndex + ((PUSB_SETUP_REQ)SetupSetUsbAddr) -> wValueL; // save the USB address
                printf( "GetCfgDescr: ");
                s = CtrlGetConfigDescr( ); // Get configuration descriptor
                if (s == ERR_SUCCESS)
                {
                    cfg = ((PXUSB_CFG_DESCR)TxBuffer) -> bConfigurationValue;
                    for (i = 0; i <((PXUSB_CFG_DESCR)TxBuffer) -> wTotalLengthL; i ++)
                    {
                        printf( "x%02X ", (UINT16)( TxBuffer[i]) );
                    }
                    printf("\n");
                    //Analyze the configuration descriptor, get the endpoint data/each endpoint address/each endpoint size, etc., update the variables endp_addr and endp_size, etc.
                    if_cls = ((PXUSB_CFG_DESCR_LONG)TxBuffer) -> itf_descr.bInterfaceClass; // interface class code
                    if (dv_cls == 0x00 && if_cls == USB_DEV_CLASS_STORAGE )// It is a USB storage device, basically confirm it is a U disk
                    {
                        s = CtrlSetUsbConfig( cfg ); // Set USB device configuration
                        if (s == ERR_SUCCESS)
                        {
                            RootHubDev[RootHubIndex].DeviceStatus = ROOT_DEV_SUCCESS;
                            RootHubDev[RootHubIndex].DeviceType = USB_DEV_CLASS_STORAGE;
                            printf( "USB-Disk Ready\n" );
                            SetUsbSpeed( 1 ); // The default is full speed
                            return( ERR_SUCCESS );
                        }
                    }
                    else if (dv_cls == 0x00 && if_cls == USB_DEV_CLASS_PRINTER && ((PXUSB_CFG_DESCR_LONG)TxBuffer) -> itf_descr.bInterfaceSubClass == 0x01 )// is a printer device
                    {
                        printf( "USB-Print OK\n" );
                        if((TxBuffer[19] == 5)&&(TxBuffer[20]&&0x80))
                        {
                            RootHubDev[RootHubIndex].GpVar = TxBuffer[20];//IN endpoint
                        }
                        else if((TxBuffer[19] == 5)&&((TxBuffer[20]&&0x80) == 0))
                        {
                            RootHubDev[RootHubIndex].GpVar1 = TxBuffer[20];//OUT endpoint
                        }
                        if((TxBuffer[26] == 5)&&(TxBuffer[20]&&0x80))
                        {
                            RootHubDev[RootHubIndex].GpVar = TxBuffer[27];//IN endpoint
                        }
                        else if((TxBuffer[26] == 5)&&((TxBuffer[20]&&0x80) == 0))
                        {
                            RootHubDev[RootHubIndex].GpVar1 = TxBuffer[27];//OUT endpoint
                        }
// RootHubDev[RootHubIndex].GpVar = ((PUSB_CFG_DESCR_LONG)TxBuffer) -> endp_descr[0].bEndpointAddress;// Save bulk transfer endpoint
                        s = CtrlSetUsbConfig( cfg ); // Set USB device configuration
                        if (s == ERR_SUCCESS)
                        {
                            s = CtrlSetUsbIntercace(cfg);
// if(s == ERR_SUCCESS){
                            //The endpoint information needs to be saved for the main program to perform USB transfer
                            s = CtrlGetXPrinterReport1( ); //Printer command
                            if(s == ERR_SUCCESS)
                            {
                                RootHubDev[RootHubIndex].DeviceStatus = ROOT_DEV_SUCCESS;
                                RootHubDev[RootHubIndex].DeviceType = USB_DEV_CLASS_PRINTER;
                                printf( "USB-Print Ready\n" );
                                SetUsbSpeed( 1 ); // The default is full speed
                                return( ERR_SUCCESS );
                            }
//}
                        }
                    }
                    else if (dv_cls == 0x00 && if_cls == USB_DEV_CLASS_HID && ((PXUSB_CFG_DESCR_LONG)TxBuffer) -> itf_descr.bInterfaceSubClass <= 0x01 )// It is a HID device, keyboard/mouse, etc.
                    {
                        s = AnalyzeHidIntEndp( TxBuffer ); // Analyze the address of the HID interrupt endpoint from the descriptor
                        RootHubDev[RootHubIndex].GpVar = s & USB_ENDP_ADDR_MASK ;// Save the address of the interrupt endpoint, bit 7 is used to synchronize the flag bit, cleared to 0
                        if_cls = ((PXUSB_CFG_DESCR_LONG)TxBuffer) -> itf_descr.bInterfaceProtocol;
                        s = CtrlSetUsbConfig( cfg ); // Set USB device configuration
                        printf( "HID: %02x",(UINT16)s );
                        if (s == ERR_SUCCESS)
                        {
                            printf( "GetHIDReport: ");
                            s = CtrlGetHIDDeviceReport(); //Get report descriptor
                            if(s == ERR_SUCCESS)
                            {
                                for (i = 0; i <64; i++)
                                {
                                    printf( "x%02X ", (UINT16)( TxBuffer[i]) );
                                }
                                printf("\n");
                            }
                            //Set_Idle( );
                            //The endpoint information needs to be saved for the main program to perform USB transfer
                            RootHubDev[RootHubIndex].DeviceStatus = ROOT_DEV_SUCCESS;
                            CtrlSetUsbIDLE(0x0a);
