crowdwave/ch559samplestranslated/EVT/EXAM/USB/Host/USBH_HUB_KM.C
                            if (if_cls == 1)
                            {
                                RootHubDev[RootHubIndex].DeviceType = DEV_TYPE_KEYBOARD;
                                //Further initialization, such as device keyboard indicator LED, etc.
                                printf( "USB-Keyboard Ready\n" );
                                SetUsbSpeed( 1 ); // The default is full speed
                                return( ERR_SUCCESS );
                            }
                            else if (if_cls == 2)
                            {
                                RootHubDev[RootHubIndex].DeviceType = DEV_TYPE_MOUSE;
                                //In order to query the mouse status in the future, the descriptor should be analyzed to obtain the address, length and other information of the interrupt port
                                printf( "USB-Mouse Ready\n" );
                                SetUsbSpeed( 1 ); // The default is full speed
                                return( ERR_SUCCESS );
                            }
                            s = ERR_USB_UNSUPPORT;
                        }
                    }
                    else if (dv_cls == USB_DEV_CLASS_HUB) // is a HUB device, hub, etc.
                    {
                        s = AnalyzeHidIntEndp( TxBuffer ); // Analyze the address of the HID interrupt endpoint from the descriptor
                        RootHubDev[RootHubIndex].GpVar1 = s & USB_ENDP_ADDR_MASK ;// Save the address of the interrupt endpoint, bit 7 is used to synchronize the flag bit, cleared to 0
                        printf( "GetHubDescr: ");
                        s = CtrlGetHubDescr( );
                        if (s == ERR_SUCCESS)
                        {
                            for( i = 0; i <TxBuffer[0]; i++)
                            {
                                printf( "x%02X ",(UINT16)(TxBuffer[i]) );
                            }
                            printf("\n");
                            RootHubDev[RootHubIndex].GpVar = ((PXUSB_HUB_DESCR)TxBuffer) -> bNbrPorts;// Save the number of HUB ports
                            if (RootHubDev[RootHubIndex].GpVar> HUB_MAX_PORTS)
                            {
                                RootHubDev[RootHubIndex].GpVar = HUB_MAX_PORTS;// Because when defining the structure DevOnHubPort, it is artificially assumed that each HUB does not exceed HUB_MAX_PORTS ports
                            }
                            //if (((PXUSB_HUB_DESCR)TxBuffer) -> wHubCharacteristics[0] & 0x04) printf("Composite device with hub\n");
                            //else printf("Single hub product\n");
                            s = CtrlSetUsbConfig( cfg ); // Set USB device configuration
                            if (s == ERR_SUCCESS)
                            {
                                RootHubDev[RootHubIndex].DeviceStatus = ROOT_DEV_SUCCESS;
                                RootHubDev[RootHubIndex].DeviceType = USB_DEV_CLASS_HUB;
                                //The endpoint information needs to be saved for the main program to perform USB transmission. The interrupt endpoint can be used for HUB event notification, but this program uses query status control transmission instead
                                //Power on each port of the HUB, query the status of each port, initialize the HUB port with the device connected, and initialize the device
                                for (i = 1; i <= RootHubDev[RootHubIndex].GpVar; i ++ )// Power on all ports of the HUB
                                {
                                    DevOnHubPort[RootHubIndex][i-1].DeviceStatus = ROOT_DEV_DISCONNECT; // Clear the status of the device on the external HUB port
                                    s = HubSetPortFeature( i, HUB_PORT_POWER );
                                    if (s != ERR_SUCCESS)
                                    {
                                        printf( "Ext-HUB Port_%1d# power on error\n",(UINT16)i );// Port power on failure
                                    }
                                }
// for (i = 1; i <= RootHubDev[RootHubIndex].GpVar; i ++) // Clear the connection status of each port of the HUB
// {
// s = HubClearPortFeature( i, HUB_C_PORT_CONNECTION );
// if (s != ERR_SUCCESS)
// {
// printf( "Ext-HUB Port_%1d# clear connection error\n",(UINT16)i );// Port connection status clearing failed
//}
//}
                                for (i = 1; i <= RootHubDev[RootHubIndex].GpVar; i ++) // Query the connection status of each HUB port
                                {
                                    s = HubGetPortStatus( i ); // Get port status
                                    if (s != ERR_SUCCESS)
                                    {
                                        printf( "Ext-HUB Port_%1d# clear connection error\n",(UINT16)i ); // port connection status clearing failed
                                    }
// if ((TxBuffer[0] != 0) && (DevOnHubPort[RootHubIndex][i-1].DeviceStatus != ROOT_DEV_SUCCESS) ){ //There is a device connection on the downstream port of HUB
// s = HubSetPortFeature( i, HUB_PORT_RESET ); // Reset the port with device connection
// if (s != ERR_SUCCESS) continue;
// // return s; // may be that the HUB is disconnected
// do // Query the reset port, until the reset is completed, display the status after completion
// {
// mDelaymS( 1 );
// s = HubGetPortStatus( i );
// if (s != ERR_SUCCESS) continue;//return s; // It may be that the HUB is disconnected
//} while (TxBuffer[0] & (1<<(HUB_PORT_RESET&0x07)) ); // The port is reset and wait
//}
                                }
                                SetUsbSpeed( 1 ); // The default is full speed
                                return( ERR_SUCCESS );
                            }
                        }
                    }
                    else // can be further analyzed
                    {
                        printf("dv_cls=%02x,if_cls =%02x",(UINT16)dv_cls,(UINT16)if_cls);
                        s = CtrlSetUsbConfig( cfg ); // Set USB device configuration
                        if (s == ERR_SUCCESS)
                        {
                            //The endpoint information needs to be saved for the main program to perform USB transfer
                            RootHubDev[RootHubIndex].DeviceStatus = ROOT_DEV_SUCCESS;
                            RootHubDev[RootHubIndex].DeviceStatus = dv_cls? Dv_cls: if_cls;
                            SetUsbSpeed( 1 ); // The default is full speed
                            return( ERR_SUCCESS ); // The unknown device is initialized successfully
                        }
                    }
                }
            }
        }
        printf( "InitRootDev Err = %02X\n", (UINT16)s );
        RootHubDev[RootHubIndex].DeviceStatus = ROOT_DEV_FAILED;
        SetUsbSpeed( 1 ); // The default is full speed
        continue;
    }
    return( s );
}
/************************************************* ******************************
* Function Name: EnumAllRootDevice
* Description: Enumerate all USB devices of ROOT-HUB port
* Input: None
* Output: None
* Return: None
************************************************** *****************************/
UINT8 EnumAllRootDevice( void)
{
    UINT8I s, RootHubIndex;
    printf( "EnumAllRootDev\n" );
    for (RootHubIndex = 0; RootHubIndex <2; RootHubIndex ++)
    {
        printf( "RootHubIndex %02x\n",(UINT16)RootHubIndex );
        if (RootHubDev[RootHubIndex].DeviceStatus == ROOT_DEV_CONNECTED) // The device just inserted has not been initialized
        {
            s = InitRootDevice( RootHubIndex ); // Initialize/enumerate the USB device of the specified HUB port
            if (s != ERR_SUCCESS)
            {
                return( s );
            }
        }
    }
    return( ERR_SUCCESS );
}
/************************************************* ******************************
* Function Name: InitDevOnHub
* Description: Initialize the secondary USB device after enumerating the external HUB
* Input: UINT8 RootHubIndex specifies ROOT_HUB
                   UINT8 HubPortIndex specifies the external HUB
* Output: None
* Return: ERR_SUCCESS success
                   ERR_USB_UNKNOWN unknown device
************************************************** *****************************/
UINT8 InitDevOnHub( UINT8 RootHubIndex, UINT8 HubPortIndex)
{
    UINT8 i, s, cfg, dv_cls, if_cls;
    printf( "Init dev @ExtHub-port_%1d ", (UINT16)HubPortIndex );
    printf( "@Root_%1d\n", (UINT16)RootHubIndex );
    if (HubPortIndex == 0)
    {
        return( ERR_USB_UNKNOWN );
    }
    SelectHubPort( RootHubIndex, HubPortIndex ); // Select the designated port of the external HUB that operates the designated ROOT-HUB port, and select the speed
    printf( "UH_SETUP = GetDevDescr: %02x",(UINT16)UH_SETUP );
    s = CtrlGetDeviceDescr( ); // Get device descriptor
    if (s != ERR_SUCCESS)
    {
        return( s );
    }
    dv_cls = ((PXUSB_DEV_DESCR)TxBuffer) -> bDeviceClass; // device class code
    cfg = ((RootHubIndex+1)<<4) + HubPortIndex; // Calculate a USB address to avoid address overlap
    s = CtrlSetUsbAddress( cfg ); // Set USB device address
    if (s != ERR_SUCCESS)
    {
        return( s );
    }
    DevOnHubPort[RootHubIndex][HubPortIndex-1].DeviceAddress = cfg; // Save the assigned USB address
    printf( "GetCfgDescr: ");
    s = CtrlGetConfigDescr( ); // Get configuration descriptor
    if (s != ERR_SUCCESS)
    {
        return( s );
    }
    cfg = ((PXUSB_CFG_DESCR)TxBuffer) -> bConfigurationValue;
    for (i = 0; i <((PXUSB_CFG_DESCR)TxBuffer) -> wTotalLengthL; i ++)
    {
        printf( "x%02X ", (UINT16)( TxBuffer[i]) );
    }
    printf("\n");
    /* Analyze the configuration descriptor, get the endpoint data/each endpoint address/each endpoint size, etc., update the variables endp_addr and endp_size, etc. */
    if_cls = ((PXUSB_CFG_DESCR_LONG)TxBuffer) -> itf_descr.bInterfaceClass; // interface class code
    if (dv_cls == 0x00 && if_cls == USB_DEV_CLASS_STORAGE) // It is a USB storage device, basically confirm it is a U disk
    {
        s = CtrlSetUsbConfig( cfg ); // Set USB device configuration
        if (s == ERR_SUCCESS)
        {
            DevOnHubPort[RootHubIndex][HubPortIndex-1].DeviceStatus = ROOT_DEV_SUCCESS;
            DevOnHubPort[RootHubIndex][HubPortIndex-1].DeviceType = USB_DEV_CLASS_STORAGE;
            printf( "USB-Disk Ready\n" );
            SetUsbSpeed( 1 ); // The default is full speed
            return( ERR_SUCCESS );
        }
    }
    else if (dv_cls == 0x00 && if_cls == USB_DEV_CLASS_HID && ((PXUSB_CFG_DESCR_LONG)TxBuffer) -> itf_descr.bInterfaceSubClass <= 0x01) // It is a HID device, keyboard/mouse, etc.
    {
        s = AnalyzeHidIntEndp( TxBuffer ); // Analyze the address of the HID interrupt endpoint from the descriptor
        DevOnHubPort[RootHubIndex][HubPortIndex-1].GpVar = s; // Save the address of the interrupt endpoint, bit 7 is used for the synchronization flag, cleared to 0
        if_cls = ((PXUSB_CFG_DESCR_LONG)TxBuffer) -> itf_descr.bInterfaceProtocol;
        s = CtrlSetUsbConfig( cfg ); // Set USB device configuration
        if (s == ERR_SUCCESS)
        {
            //The endpoint information needs to be saved for the main program to perform USB transfer
            DevOnHubPort[RootHubIndex][HubPortIndex-1].DeviceStatus = ROOT_DEV_SUCCESS;
            if (if_cls == 1)
            {
                DevOnHubPort[RootHubIndex][HubPortIndex-1].DeviceType = DEV_TYPE_KEYBOARD;
                //Further initialization, such as device keyboard indicator LED, etc.
                printf( "USB-Keyboard Ready\n" );
                SetUsbSpeed( 1 ); // The default is full speed
                return( ERR_SUCCESS );
            }
            else if (if_cls == 2)
            {
                DevOnHubPort[RootHubIndex][HubPortIndex-1].DeviceType = DEV_TYPE_MOUSE;
                //In order to query the mouse status in the future, the descriptor should be analyzed to obtain the address, length and other information of the interrupt port
                printf( "USB-Mouse Ready\n" );
                SetUsbSpeed( 1 ); // The default is full speed
                return( ERR_SUCCESS );
            }
            s = ERR_USB_UNSUPPORT;
        }
    }
    else if (dv_cls == USB_DEV_CLASS_HUB) // is a HUB device, hub, etc.
    {
        DevOnHubPort[RootHubIndex][HubPortIndex-1].DeviceType = USB_DEV_CLASS_HUB;
        printf( "This program don't support Level 2 HUB\n"); // Need to support multi-level HUB cascade, please refer to this program to expand
        s = HubClearPortFeature( i, HUB_PORT_ENABLE ); // Disable HUB port
        if (s != ERR_SUCCESS)
        {
            return( s );
        }
        s = ERR_USB_UNSUPPORT;
    }
    else // can be further analyzed
    {
        s = CtrlSetUsbConfig( cfg ); // Set USB device configuration
        if (s == ERR_SUCCESS)
        {
            //The endpoint information needs to be saved for the main program to perform USB transfer
            DevOnHubPort[RootHubIndex][HubPortIndex-1].DeviceStatus = ROOT_DEV_SUCCESS;
            DevOnHubPort[RootHubIndex][HubPortIndex-1].DeviceType = dv_cls? Dv_cls: if_cls;
            SetUsbSpeed( 1 ); // The default is full speed
            return( ERR_SUCCESS ); //Unknown device initialized successfully
        }
    }
    printf( "InitDevOnHub Err = %02X\n", (UINT16)s );
    DevOnHubPort[RootHubIndex][HubPortIndex-1].DeviceStatus = ROOT_DEV_FAILED;
    SetUsbSpeed( 1 ); // The default is full speed
    return( s );
}
/************************************************* ******************************
* Function Name: EnumHubPort
* Description: Enumerate each port of the external HUB hub on the specified ROOT-HUB port, check whether each port is connected or removed, and initialize the secondary USB device
* Input: UINT8 RootHubIndex ROOT_HUB0 and ROOT_HUB1
* Output: None
* Return: ERR_SUCCESS success
                   Other failure
************************************************** *****************************/
UINT8 EnumHubPort( UINT8 RootHubIndex)
{
    UINT8 i, s;
    printf( "EnumHubPort\n" );
    for (i = 1; i <= RootHubDev[RootHubIndex].GpVar; i ++) // Query whether the port of the hub has changed
    {
        SelectHubPort( RootHubIndex, 0 ); // Select the ROOT-HUB port specified by the operation, set the current USB speed and the USB address of the operated device
        s = HubGetPortStatus( i ); // Get port status
        if (s != ERR_SUCCESS)
        {
            return( s ); // Maybe the HUB is disconnected
        }
        if ((( TxBuffer[0]&(1<<(HUB_PORT_CONNECTION&0x07))) && (TxBuffer[2]&(1<<(HUB_C_PORT_CONNECTION&0x07)) ))||(TxBuffer[2] == 0x10))
        {
            // Found a device connection
            DevOnHubPort[RootHubIndex][i-1].DeviceStatus = ROOT_DEV_CONNECTED; // There is a device connection
            DevOnHubPort[RootHubIndex][i-1].DeviceAddress = 0x00;
            s = HubGetPortStatus( i ); // Get port status
            if (s != ERR_SUCCESS)
            {
                return( s ); // Maybe the HUB is disconnected
            }
            DevOnHubPort[RootHubIndex][i-1].DeviceSpeed ​​= TxBuffer[1] & (1<<(HUB_PORT_LOW_SPEED&0x07))? 0: 1;// Low speed or full speed
            if (DevOnHubPort[RootHubIndex][i-1].DeviceSpeed)
            {
                printf( "Found full speed device on port %1d\n", (UINT16)i );
            }
            else
            {
                printf( "Found low speed device on port %1d\n", (UINT16)i );
            }
            mDelaymS( 200 ); // Wait for the device to be stable
            s = HubSetPortFeature( i, HUB_PORT_RESET ); // reset the port with the device connected
            if (s != ERR_SUCCESS)
            {
                return( s ); // Maybe the HUB is disconnected
            }
            printf( "Reset port and then wait in\n" );
            do // Query the reset port until the reset is completed, and display the status after completion
            {
                mDelaymS( 1 );
                s = HubGetPortStatus( i );
                if (s != ERR_SUCCESS)
                {
                    return( s ); // Maybe the HUB is disconnected
                }
            }
            while (TxBuffer[0] & (1<<(HUB_PORT_RESET&0x07)) ); // The port is reset and wait
            mDelaymS( 100 );
            s = HubClearPortFeature( i, HUB_C_PORT_RESET ); // Clear reset completion flag
// s = HubSetPortFeature( i, HUB_PORT_ENABLE ); // enable HUB port
            s = HubClearPortFeature( i, HUB_C_PORT_CONNECTION ); // Clear connection or remove change flag
            if (s != ERR_SUCCESS)
            {
                return( s );
            }
            s = HubGetPortStatus( i ); // Read the status again and check if the device is still
            if (s != ERR_SUCCESS)
            {
                return( s );
            }
            if ((TxBuffer[0]&(1<<(HUB_PORT_CONNECTION&0x07))) == 0)
            {
                DevOnHubPort[RootHubIndex][i-1].DeviceStatus = ROOT_DEV_DISCONNECT; // The device is gone
            }
            s = InitDevOnHub( RootHubIndex, i ); // initialize secondary USB device
            if (s != ERR_SUCCESS)
            {
                return( s );
            }
            SetUsbSpeed( 1 ); // The default is full speed
        }
        else if (TxBuffer[2]&(1<<(HUB_C_PORT_ENABLE&0x07))) // device connection error
        {
            HubClearPortFeature( i, HUB_C_PORT_ENABLE ); // Clear the connection error flag
            printf( "Device on port error\n" );
            s = HubSetPortFeature( i, HUB_PORT_RESET ); // reset the port with the device connected
            if (s != ERR_SUCCESS)
            {
                return( s ); // Maybe the HUB is disconnected
            }
            do // Query the reset port until the reset is completed, and display the status after completion
            {
                mDelaymS( 1 );
                s = HubGetPortStatus( i );
                if (s != ERR_SUCCESS)
                {
                    return( s ); // Maybe the HUB is disconnected
                }
            }
            while (TxBuffer[0] & (1<<(HUB_PORT_RESET&0x07)) ); // The port is reset and wait
        }
        else if ((TxBuffer[0]&(1<<(HUB_PORT_CONNECTION&0x07))) == 0) // The device has been disconnected
        {
            if (DevOnHubPort[RootHubIndex][i-1].DeviceStatus >= ROOT_DEV_CONNECTED)
            {
                printf( "Device on port %1d removed\n", (UINT16)i );
            }
            DevOnHubPort[RootHubIndex][i-1].DeviceStatus = ROOT_DEV_DISCONNECT; // There is a device connection
            if (TxBuffer[2]&(1<<(HUB_C_PORT_CONNECTION&0x07)))
            {
                HubClearPortFeature( i, HUB_C_PORT_CONNECTION ); // Clear the removal change flag
            }
        }
    }
    return( ERR_SUCCESS ); // Return operation is successful
}
/************************************************* ******************************
* Function Name: EnumAllHubPort
* Description: Enumerate all secondary USB devices behind the external HUB under the ROOT-HUB port
* Input: None
* Output: None
* Return: ERR_SUCCESS success
                   Other failure
************************************************** *****************************/
UINT8 EnumAllHubPort( void)
{
    UINT8 s, RootHubIndex;
    printf( "EnumAllHubPort\n" );
    for (RootHubIndex = 0; RootHubIndex != 2; RootHubIndex ++)
    {
        if (RootHubDev[RootHubIndex].DeviceStatus >= ROOT_DEV_SUCCESS && RootHubDev[RootHubIndex].DeviceType == USB_DEV_CLASS_HUB )// HUB enumeration succeeded
        {
            SelectHubPort( RootHubIndex, 0 ); // Select the ROOT-HUB port specified by the operation, set the current USB speed and the USB address of the operated device
            //What to do? Power on each port of the HUB, query the status of each port, initialize the HUB port with the device connected, and initialize the device
// for (i = 1; i <= RootHubDev[RootHubIndex].GpVar; i ++ ){ // Initialize each port of HUB
// s = HubSetPortFeature( i, HUB_PORT_POWER ); // Power on each port of HUB
// if (s != ERR_SUCCESS)
// {
// return( s ); // The HUB may be disconnected
//}
//}
            s = EnumHubPort( RootHubIndex ); // Enumerate each port of the external HUB hub on the specified ROOT-HUB port, check whether each port is connected or removed
            if (s != ERR_SUCCESS) // Maybe the HUB is disconnected
            {
                printf( "EnumAllHubPort err = %02X\n", (UINT16)s );
            }
            SetUsbSpeed( 1 ); // The default is full speed
        }
    }
    return( ERR_SUCCESS );
}
/************************************************* ******************************
* Function Name: SearchTypeDevice
* Description: Search for the port number where the specified type of device is located on each port of the ROOT-HUB and external HUB. If the output port number is 0xFFFF, it is not found
* Input: UINT8 type Search device type
* Output: None
* Return: The output high 8 bits are the ROOT-HUB port number, the low 8 bits are the port number of the external HUB, and the low 8 bits are 0, the device is directly on the ROOT-HUB port
                   Of course, you can also search according to the PID of the USB manufacturer's VID product (record the VID and PID of each device in advance), and specify the search serial number
************************************************** *****************************/
UINT16 SearchTypeDevice( UINT8 type)
{
    UINT8 RootHubIndex, HubPortIndex;
    for (RootHubIndex = 0; RootHubIndex != 2; RootHubIndex ++) // The current search can avoid the problem that the device is unplugged in the middle and some information is not updated in time
    {
        if (RootHubDev[RootHubIndex].DeviceType == type && RootHubDev[RootHubIndex].DeviceStatus >= ROOT_DEV_SUCCESS)
        {
            return( (UINT16)RootHubIndex << 8 ); // The type matches and the enumeration is successful, on the ROOT-HUB port
        }
        if (RootHubDev[RootHubIndex].DeviceType == USB_DEV_CLASS_HUB && RootHubDev[RootHubIndex].DeviceStatus >= ROOT_DEV_SUCCESS )// External hub HUB and enumeration is successful
        {
            for (HubPortIndex = 1; HubPortIndex <= RootHubDev[RootHubIndex].GpVar; HubPortIndex ++ )// Search each port of external HUB
            {
                if (DevOnHubPort[RootHubIndex][HubPortIndex-1].DeviceType == type && DevOnHubPort[RootHubIndex][HubPortIndex-1].DeviceStatus >= ROOT_DEV_SUCCESS)
                {
                    return( ((UINT16)RootHubIndex << 8) | HubPortIndex ); // Type matches and enumeration is successful
                }
            }
        }
    }
    return( 0xFFFF );
}
/************************************************* ******************************
* Function Name: mInitSTDIO
* Description: Initialize the serial port for printf and getkey input and output
* Input: None
* Output: None
* Return: None
************************************************** *****************************/
void mInitSTDIO( void)
{
// SCON = 0x50;
    SM0 = 0;
    SM1 = 1;
    SM2 = 0;
    REN = 1;
    PCON |= SMOD;
    TMOD = TMOD & ~ bT1_GATE & ~ bT1_CT & ~ MASK_T1_MOD | bT1_M1; // 0X20
    T2MOD = T2MOD | bTMR_CLK | bT1_CLK; // *12
