crowdwave/ch559samplestranslated/EVT/EXAM/USB/Host/USBH_HUB_KM.C
    TH1 = 0-13;//0xF3; /* 12MHz crystal oscillator, 4800bps*12=57600bps */
    TR1 = 1;
    TI = 1;
}
/************************************************* ******************************
* Function Name: InitUSB_Host
* Description: Initialize the USB host
* Input: None
* Output: None
* Return: None
************************************************** *****************************/
void InitUSB_Host( void)
{
    UINT8 i;
    IE_USB = 0;
// LED_CFG = 1;
// LED_RUN = 0;
    USB_CTRL = bUC_HOST_MODE; // Set the mode first
    USB_DEV_AD = 0x00;
    UH_EP_MOD = bUH_EP_TX_EN | bUH_EP_RX_EN;
    UH_RX_DMA = RxBuffer;
    UH_TX_DMA = TxBuffer;
    UH_RX_CTRL = 0x00;
    UH_TX_CTRL = 0x00;
    USB_CTRL = bUC_HOST_MODE | bUC_INT_BUSY | bUC_DMA_EN; // Start the USB host and DMA, and automatically pause before the interrupt flag is cleared
// UHUB0_CTRL = 0x00;
// UHUB1_CTRL = 0x00;
    UH_SETUP = bUH_SOF_EN;
    USB_INT_FG = 0xFF; // Clear interrupt flag
    for (i = 0; i != 2; i ++)
    {
        DisableRootHubPort( i ); // Clear
    }
    USB_INT_EN = bUIE_TRANSFER | bUIE_DETECT;
// IE_USB = 1; // query method
}
/************************************************* ******************************
* Function Name: SETorOFFNumLock
* Description: NumLock lighting judgment
* Input: PUINT8 buf lighting key value
* Output: None
* Return: None
************************************************** *****************************/
UINT8 SETorOFFNumLock(PUINT8 buf)
{
    UINT8 tmp[]= {0x21,0x09,0x00,0x02,0x00,0x00,0x01,0x00};
    UINT8 len,s;
    if((buf[2]==0x53)&(buf[0]|buf[1]|buf[3]|buf[4]|buf[5]|buf[6]|buf[7]==0 ))
    {
        for (s = 0; s != sizeof( tmp ); s ++)
        {
            ((PUINT8X)pSetupReq)[ s] = tmp[s];
        }
        s = HostCtrlTransfer( TxBuffer, &len ); // Perform control transfer
        if (s != ERR_SUCCESS)
        {
            return( s );
        }
    }
    return( ERR_SUCCESS );
}
/************************************************* ******************************
* Function Name: mStopIfError
* Description: Check the operating status, if there is an error, display the error code and stop
* Input: UINT8 iError
* Output: None
* Return: None
************************************************** *****************************/
void mStopIfError( UINT8 iError)
{
    if (iError == ERR_SUCCESS)
    {
        return; // operation is successful
    }
    printf( "Error: %02X\n", (UINT16)iError ); // display error
    /* After encountering an error, you should analyze the error code and CH559DiskStatus status. For example, call CH559DiskReady to query whether the current U disk is connected. If the U disk is disconnected, then wait for the U disk to be plugged in and then operate.
       Suggested processing steps after error:
       1. Call CH559DiskReady once, and continue the operation if successful, such as Open, Read/Write, etc.
       2. If CH559DiskReady is unsuccessful, then forcibly start the operation from the beginning (waiting for U disk connection, CH559DiskReady, etc.) */
    while (1)
    {
// LED_TMP=0; // LED flashes
// mDelaymS( 100 );
// LED_TMP=1;
// mDelaymS( 100 );
    }
}
main()
{
    UINT8 i, c,s, len, endp,HUBFlag;
    UINT16 loc,TotalCount;
    UINT8 buf[100]; //The length can be specified according to the application
    HUBFlag = 0;
    mInitSTDIO( ); //In order to let the computer monitor the demonstration process through the serial port
    printf( "Start @ChipID=%02X\n", (UINT16)CHIP_ID );
    InitUSB_Host( );
    CH559LibInit( ); //Initialize CH559 library to support U disk files
    FoundNewDev = 0;
    printf( "Wait Device In\n" );
    while (1)
    {
        s = ERR_SUCCESS;
        if (UIF_DETECT) // Process if there is a USB host detection interrupt
        {
            UIF_DETECT = 0; // Clear interrupt flag
            s = AnalyzeRootHub( ); // analyze ROOT-HUB status
            if (s == ERR_USB_CONNECT)
            {
                FoundNewDev = 1;
            }
        }
        if (FoundNewDev && s == ERR_USB_CONNECT) // There is a new USB device inserted
        {
            FoundNewDev = 0;
            mDelaymS( 200 ); // Since the USB device has just been inserted and is not yet stable, wait for hundreds of milliseconds for the USB device to eliminate plugging jitter
            s = EnumAllRootDevice( ); // Enumerate USB devices of all ROOT-HUB ports
            if (s != ERR_SUCCESS)
            {
                printf( "EnumAllRootDev err = %02X\n", (UINT16)s );
            }
        }
        loc = SearchTypeDevice( DEV_TYPE_MOUSE ); // Search for the port number of the specified type of device on each port of ROOT-HUB and external HUB
        if (loc != 0xFFFF) // Found it, what if there are two MOUSEs?
        {
            printf( "Query Mouse @%04X\n", loc );
            i = (UINT8)( loc >> 8 );
            len = (UINT8)loc;
            SelectHubPort( i, len ); // Select the ROOT-HUB port specified by the operation, set the current USB speed and the USB address of the operated device
            endp = len? DevOnHubPort[i][len-1].GpVar: RootHubDev[i].GpVar; // interrupt endpoint address, bit 7 is used for synchronization flag
// printf( "DevOnHubPort @%02X\n", (UINT16)DevOnHubPort[i][len-1].GpVar );
// printf( "RootHubDev @%04X\n", (UINT16)RootHubDev[i].GpVar );
// mDelaymS(1);
            if (endp & USB_ENDP_ADDR_MASK) // Endpoint is valid
            {
                s = USBHostTransact( USB_PID_IN << 4 | endp & 0x7F, endp & 0x80? bUH_R_TOG | bUH_T_TOG: 0, 0 ); // CH559 transfers transactions, gets data, NAK does not retry
                if (s == ERR_SUCCESS)
                {
                    endp ^= 0x80; // Synchronization flag flip
                    if (len)
                    {
                        DevOnHubPort[i][len-1].GpVar = endp; // Save the synchronization flag
                    }
                    else
                    {
                        RootHubDev[i].GpVar = endp;
                    }
                    len = USB_RX_LEN; // The received data length
                    if (len)
                    {
                        printf("Mouse data: ");
                        for (i = 0; i <len; i ++)
                        {
                            printf("x%02X ",(UINT16)(RxBuffer[i]) );
                        }
                        printf("\n");
                    }
                }
                else if (s != (USB_PID_NAK | ERR_USB_TRANSFER))
                {
                    printf("Mouse error %02x\n",(UINT16)s); // It may be disconnected
                }
            }
            else
            {
                printf("Mouse no interrupt endpoint\n");
            }
            SetUsbSpeed( 1 ); // The default is full speed
        }
        // Use timing to simulate subjective needs, you need to operate the keyboard
        loc = SearchTypeDevice( DEV_TYPE_KEYBOARD ); // Search for the port number where the specified type of device is located on each port of ROOT-HUB and external HUB
        if (loc != 0xFFFF) // Found it, what if there are two KeyBoards?
        {
            printf( "Query Keyboard @%04X\n", loc );
            i = (UINT8)( loc >> 8 );
            len = (UINT8)loc;
            SelectHubPort( i, len ); // Select the ROOT-HUB port specified by the operation, set the current USB speed and the USB address of the operated device
            endp = len? DevOnHubPort[i][len-1].GpVar: RootHubDev[i].GpVar; // interrupt endpoint address, bit 7 is used for synchronization flag
            printf("%02X ",endp);
            if (endp & USB_ENDP_ADDR_MASK) // Endpoint is valid
            {
                s = USBHostTransact( USB_PID_IN << 4 | endp & 0x7F, endp & 0x80? bUH_R_TOG | bUH_T_TOG: 0, 0 ); // CH559 transfers transactions, gets data, NAK does not retry
                if (s == ERR_SUCCESS)
                {
                    endp ^= 0x80; // Synchronization flag flip
                    if (len)
                    {
                        DevOnHubPort[i][len-1].GpVar = endp; // Save the synchronization flag
                    }
                    else
                    {
                        RootHubDev[i].GpVar = endp;
                    }
                    len = USB_RX_LEN; // The received data length
                    if (len)
                    {
                        SETorOFFNumLock(RxBuffer);
                        printf("keyboard data: ");
                        for (i = 0; i <len; i ++)
                        {
                            printf("x%02X ",(UINT16)(RxBuffer[i]) );
                        }
                        printf("\n");
                    }
                }
                else if (s != (USB_PID_NAK | ERR_USB_TRANSFER))
                {
                    printf("keyboard error %02x\n",(UINT16)s); // may be disconnected
                }
            }
            else
            {
                printf("keyboard no interrupt endpoint\n");
            }
            SetUsbSpeed( 1 ); // The default is full speed
        }
        //Operate HUB
        loc = SearchTypeDevice( DEV_TYPE_KEYBOARD ); // Search for the port number of the specified type of device on each port of ROOT-HUB and external HUB
        if (loc != 0xFFFF) // Found it, what if there are two KeyBoards?
        {
            printf( "Query Keyboard @%04X\n", loc );
            i = (UINT8)( loc >> 8 );
            len = (UINT8)loc;
            SelectHubPort( i, len ); // Select the ROOT-HUB port specified by the operation, set the current USB speed and the USB address of the operated device
            endp = len? DevOnHubPort[i][len-1].GpVar: RootHubDev[i].GpVar; // interrupt endpoint address, bit 7 is used for synchronization flag
            printf("%02X ",endp);
            if (endp & USB_ENDP_ADDR_MASK) // Endpoint is valid
            {
                s = USBHostTransact( USB_PID_IN << 4 | endp & 0x7F, endp & 0x80? bUH_R_TOG | bUH_T_TOG: 0, 0 ); // CH559 transfers transactions, gets data, NAK does not retry
                if (s == ERR_SUCCESS)
                {
                    endp ^= 0x80; // Synchronization flag flip
                    if (len)
                    {
                        DevOnHubPort[i][len-1].GpVar = endp; // Save the synchronization flag
                    }
                    else
                    {
                        RootHubDev[i].GpVar = endp;
                    }
                    len = USB_RX_LEN; // The received data length
                    if (len)
                    {
                        //SETorOFFNumLock(RxBuffer);
                        printf("keyboard data: ");
                        for (i = 0; i <len; i ++)
                        {
                            printf("x%02X ",(UINT16)(RxBuffer[i]) );
                        }
                        printf("\n");
                    }
                }
                else if (s != (USB_PID_NAK | ERR_USB_TRANSFER))
                {
                    printf("keyboard error %02x\n",(UINT16)s); // It may be disconnected
                }
            }
            else
            {
                printf("keyboard no interrupt endpoint\n");
            }
            SetUsbSpeed( 1 ); // The default is full speed
        }
        for(i=0; i<2; i++)
        {
            if((RootHubDev[i].DeviceStatus == ROOT_DEV_SUCCESS)&&(RootHubDev[i].DeviceType == USB_DEV_CLASS_HUB))
            {
                SelectHubPort( i, 0 ); // Select the ROOT-HUB port specified by the operation, set the current USB speed and the USB address of the operated device
                endp = RootHubDev[i].GpVar1; // The address of the interrupt endpoint, bit 7 is used for the synchronization flag
                if (endp & USB_ENDP_ADDR_MASK) // Endpoint is valid
                {
                    s = USBHostTransact( USB_PID_IN << 4 | endp & 0x7F, endp & 0x80? bUH_R_TOG | bUH_T_TOG: 0, 0 ); // CH559 transfers transactions, gets data, NAK does not retry
                    if (s == ERR_SUCCESS)
                    {
                        endp ^= 0x80; // Synchronization flag flip
                        RootHubDev[i].GpVar1 = endp; // Save the synchronization flag
                        len = USB_RX_LEN; // The received data length
                        if (len)
                        {
                            EnumHubPort(i);
                            for (i = 0; i <len; i ++)
                            {
                                printf("x%02X ",(UINT16)(RxBuffer[i]) );
                            }
                            printf("\n");
                        }
                    }
                    else if (s != (USB_PID_NAK | ERR_USB_TRANSFER))
                    {
                        printf("HUB error %02x\n",(UINT16)s); // It may be disconnected
                    }
                }
                else
                {
                    printf("HUB %02d no interrupt endpoint\n",i);
                }
            }
            else
            {
                //printf("ROOTHUB %02d not HUB\n",i);
                //printf(".");
            }
        }
        //Operate USB printer
        if((P4_IN&0x01) == 0) //P40 is low, start printing
        {
            memset(TxBuffer,0,sizeof(TxBuffer));
            TxBuffer[0]=0x1B;
            TxBuffer[1]=0x40;
            TxBuffer[2]=0x1D;
            TxBuffer[3]=0x55;
            TxBuffer[4]=0x42;
            TxBuffer[5]=0x02;
            TxBuffer[6]=0x18;
            TxBuffer[7]=0x1D;
            TxBuffer[8]=0x76;
            TxBuffer[9]=0x30;
            TxBuffer[10]=0x00;
            TxBuffer[11]=0x30;
            TxBuffer[12]=0x00;
            TxBuffer[13]=0x18;
            loc = SearchTypeDevice( USB_DEV_CLASS_PRINTER ); // Search for the port number of the specified type of device on each port of ROOT-HUB and external HUB
            if (loc != 0xFFFF) // Found it, what if there are two printers?
            {
                printf( "Query Printer @%04X\n", loc );
                i = (UINT8)( loc >> 8 );
                len = (UINT8)loc;
                SelectHubPort( i, len ); // Select the ROOT-HUB port specified by the operation, set the current USB speed and the USB address of the operated device
                endp = len? DevOnHubPort[i][len-1].GpVar: RootHubDev[i].GpVar; // Endpoint address, bit 7 is used for synchronization flag
                printf("%02X ",endp);
                if (endp & USB_ENDP_ADDR_MASK) // Endpoint is valid
                {
                    UH_TX_LEN = 64; // There is no data by default, so the status stage is IN
                    s = USBHostTransact( USB_PID_OUT << 4 | endp & 0x7F, endp & 0x80? bUH_R_TOG | bUH_T_TOG: 0, 0xffff );// CH559 transfer transaction, get data, NAK retry
                    if (s == ERR_SUCCESS)
                    {
                        endp ^= 0x80; // Synchronization flag flip
                        memset(TxBuffer,0,sizeof(TxBuffer));
                        UH_TX_LEN = 64; // There is no data by default, so the status stage is IN
                        s = USBHostTransact( USB_PID_OUT << 4 | endp & 0x7F, endp & 0x80? bUH_R_TOG | bUH_T_TOG: 0, 0xffff );// CH559 transfer transaction, get data, NAK retry
                    }
                    else if (s != (USB_PID_NAK | ERR_USB_TRANSFER))
                    {
                        printf("Printer error %02x\n",(UINT16)s); // It may be disconnected
                    }
                }
                SetUsbSpeed( 1 ); // The default is full speed
            }
        }
        loc = SearchTypeDevice( USB_DEV_CLASS_STORAGE ); // Search for the port number of the specified type of device on each port of ROOT-HUB and external HUB
        if (loc != 0xFFFF) // found
        {
            printf( "Start UDISK_demo @CH559UFI library\n" );
            // U disk operation process: USB bus reset, U disk connection, get device descriptor and set USB address, optional get configuration descriptor, then arrive here, CH559 subroutine library will continue to complete the follow-up work
            i = (UINT8)( loc >> 8 );
            len = (UINT8)loc;
            SelectHubPort( i, len ); // Select the ROOT-HUB port specified by the operation, set the current USB speed and the USB address of the operated device
            CH559DiskStatus = DISK_USB_ADDR;
            for (i = 0; i != 10; i ++)
            {
                printf( "Wait DiskReady\n" );
                s = CH559DiskReady( );
                if (s == ERR_SUCCESS)
                {
                    break;
                }
                mDelaymS( 50 );
            }
            if (CH559DiskStatus >= DISK_MOUNTED) //U disk is ready
            {
                /* Read the original file */
                printf( "Open File\n" );
                strcpy( mCmdParam.Open.mPathName, "/C51/CH559HFT.C" ); //File name, the file is in the C51 subdirectory
                s = CH559FileOpen( ); //Open the file
                if (s == ERR_MISS_DIR || s == ERR_MISS_FILE )//No file found
                {
                    printf( "File not found\n" );
                }
                else // find the file or error
                {
                    printf( "%02x File not found\n",(UINT16)CH559DiskStatus );
                    TotalCount = 100; //Ready to read the total length
                    printf( "The first %d characters read from the file are:\n",TotalCount );
                    while (TotalCount) //If the file is large and cannot be read at one time, you can call CH559ByteRead to continue reading, and the file pointer will automatically move backward
                    {
                        if (TotalCount> (MAX_PATH_LEN-1))
                        {
                            c = MAX_PATH_LEN-1; //There are many remaining data, and the length of a single read and write cannot exceed sizeof( mCmdParam.Other.mBuffer)
                        }
                        else
                        {
                            c = TotalCount; //The last remaining number of bytes
                        }
                        mCmdParam.ByteRead.mByteCount = c; //Request to read dozens of bytes of data
                        mCmdParam.ByteRead.mByteBuffer= &buf[0];
                        s = CH559ByteRead( ); //Read the data block in bytes, the length of a single read and write cannot exceed MAX_BYTE_IO, and the second call is followed by the previous read
                        TotalCount -= mCmdParam.ByteRead.mByteCount;//Count, minus the current number of characters actually read
                        for (i=0; i!=mCmdParam.ByteRead.mByteCount; i++)
                        {
                            printf( "%C", mCmdParam.ByteRead.mByteBuffer[i] );//Display the read character
                        }
                        if (mCmdParam.ByteRead.mByteCount <c )//The actual number of characters read is less than the number of characters required to read, indicating that the end of the file has been reached
                        {
                            printf( "\n" );
                            printf( "File has ended\n" );
                            break;
                        }
                    }
                    printf( "Close\n" );
                    i = CH559FileClose( ); //Close the file
                    mStopIfError( i );
                }
                /* If you want to start reading and writing from the specified position, you can move the file pointer
                        mCmdParam.ByteLocate.mByteOffset = 608; //Skip the first 608 bytes of the file to start reading and writing
                        CH559ByteLocate( );
                        mCmdParam.ByteRead.mByteCount = 5; //Read 5 bytes
                        mCmdParam.ByteRead.mByteBuffer= &buf[0];
                        CH559ByteRead( ); //Read the data from the 608th byte to the 612th byte of the file directly, the first 608 bytes are skipped
                        //If you want to add new data to the end of the original file, you can move the file pointer
                        CH559FileOpen( );
                        mCmdParam.ByteLocate.mByteOffset = 0xffffffff;//Move to the end of the file
                        CH559ByteLocate( );
                        mCmdParam.ByteWrite.mByteCount = 13; //Write 13 bytes of data
                        CH559ByteWrite( ); //Add data at the end of the original file, and the newly added 13 bytes are placed at the end of the original file
                        mCmdParam.ByteWrite.mByteCount = 2; //Write 2 bytes of data
                        CH559ByteWrite( ); //Continue to add data after the original file
                        mCmdParam.ByteWrite.mByteCount = 0; //Write 0 bytes of data, in fact, this operation is used to notify the library to update the file length
                        CH559ByteWrite( ); //Write 0 bytes of data to automatically update the length of the file, so the file length is increased by 15. If you don't do this, then the file length will be automatically updated when CH559FileClose is executed
                */
                printf( "Create File\n" );
                strcpy( mCmdParam.Create.mPathName, "/NEWFILE.TXT" );//New file name, in the root directory, Chinese file name
                s = CH559FileCreate( ); //Create a new file and open it, if the file already exists, delete it and then create it
                mStopIfError( s );
                printf( "ByteWrite\n" );
                //In fact, it should be judged whether the length of the written data is consistent with the length of the defined buffer. If it is greater than the length of the buffer, it needs to be written multiple times
                i = sprintf( buf,"Note: \xd\xa This program reads and writes files on the USB flash drive in bytes, 559 simple demonstration functions.\xd\xa");/*Demo */
                for(c=0; c<10; c++)
                {
                    mCmdParam.ByteWrite.mByteCount = i; /* Specify the number of bytes written this time */
                    mCmdParam.ByteWrite.mByteBuffer = buf; /* point to buffer */
                    s = CH559ByteWrite( ); /* Write data to the file in bytes */
                    mStopIfError( s );
                    printf("Successfully written %02X times\n",(UINT16)c);
                }
                printf( "Modify\n" );
                mCmdParam.Modify.mFileAttr = 0xff; //Input parameter: the new file attribute, if it is 0FFH, it will not be modified
                mCmdParam.Modify.mFileTime = 0xffff; //Input parameter: new file time, if it is 0FFFFH, do not modify it, use the default time generated by the newly created file
                mCmdParam.Modify.mFileDate = MAKE_FILE_DATE( 2020, 8, 15 ); //Input parameters: new file date: 2016.01.15
                mCmdParam.Modify.mFileSize = 0xffffffff; //Input parameters: the new file length, the file is written in bytes, the length should be automatically updated when the file is closed by the library, so it is not modified here
                i = CH559FileModify( ); //Modify the current file information, modification date
                mStopIfError( i );
                printf( "Close\n" );
                mCmdParam.Close.mUpdateLen = 1; //Automatically calculate the file length, write the file in bytes, it is recommended to let the library close the file to automatically update the file length
