crowdwave/ch559samplestranslated/EVT/EXAM/USB/Host/USBH_HUB_KM.C
                i = CH559FileClose( );
                mStopIfError( i );
                /*
                                                        printf( "RenameFilename\n" );
                                                        strcpy( mCmdParam.Open.mPathName, "/111.TXT" ); //File name, the file is in the C51 subdirectory
                                                        s = CH559FileOpen( ); //Open the file
                                                        if(s == ERR_SUCCESS){
                                                            i = RenameFilename(Rename,sizeof(Rename));
                                                            if (i != ERR_SUCCESS) printf( "Error Rename fail: %02X\n", (UINT16)i );//Display error
                                                        }
                */
                /* Delete a file */
                printf( "Delete\n" );
                strcpy( mCmdParam.Create.mPathName, "/OLD.TXT" );//The name of the file to be deleted, in the root directory
                i = CH559FileErase( ); //Delete the file and close
                if (i != ERR_SUCCESS)
                {
                    printf( "Error File not exist: %02X\n", (UINT16)i ); //Display error
                }
                printf( "U disk demo complete\n" );
            }
            else
            {
                printf( "U disk is not ready ERR =%02X\n", (UINT16)s );
            }
while(1); //The code stops here during U disk demonstration
        }
    }
}
